{"id":110766,"date":"2024-01-15T10:00:30","date_gmt":"2024-01-15T10:00:30","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=110766"},"modified":"2024-06-11T09:53:54","modified_gmt":"2024-06-11T08:53:54","slug":"renting-out-your-property-a-checklist-for-landlords","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html","title":{"rendered":"Renting Out Your Property: A Checklist for Landlords"},"content":{"rendered":"<p>Whether you’ve inherited a place or you’re considering a buy-to-let<\/a>, renting out a property is a pretty big deal. Being a landlord can be a source of extra income (whilst owning a long-term asset for the future) but renting out your property also comes with plenty of risk and responsibility attached, along with an obligation to <a href=\"https:\/\/www.theaccountancy.co.uk\/landlords\/do-landlords-pay-tax-60715.html\" rel=\"noopener\" target=\"_blank\">pay tax on your property income<\/a>!<\/p>\n<h3>How do I know if I’m a landlord?<\/h3>\n<p>Whilst some people might think of landlords as wealthy land barons with pots of money, the reality is that people become landlords for all sorts of reasons. <\/p>\n<p>You might be going travelling, working away, inherit a property, or move in with a partner, leaving a property going spare. Any number of life events <a href=\"https:\/\/www.theaccountancy.co.uk\/landlords\/do-accidental-landlords-need-to-pay-tax-224714.html\" rel=\"noopener\" target=\"_blank\">can turn ordinary people into ‘accidental’ landlords<\/a> – sometimes at fairly short notice!<\/p>\n<p>Whilst you may not think of yourself as a landlord, if you rent out a property for money then that’s exactly what you are. It’s up to you to make sure you meet your legal obligations.<\/p>\n<h3>Do I need permission to rent the property out?<\/h3>\n<p>Most people have a standard residential mortgage on their property which allows them to live in it, but you’ll normally need permission from your lender to rent that property out.<\/p>\n<p>Many lenders will give you permission fairly easily if you’re only renting out your place temporarily. If you don’t intend to return to live in the property and are letting it out long term, you’ll need to obtain a special buy-to-let mortgage instead. <\/p>\n<div class=\"actionbox\">It’s worth noting that interest rates are usually higher on buy-to-let mortgages, and you’ll need to meet their lending criteria too.<\/div>\n<p>&nbsp;<br \/>\nIf you’re planning to rent out a leasehold property, you’ll also require written permission from the freeholder to do so. You might also need to register as a landlord or pay a fee to the local authority, depending on where in the UK the property is located.<\/p>\n<h4>Do I need an HMO license?<\/h4>\n<p>If your property is especially large with multiple bedrooms, you may decide to <a href=\"https:\/\/www.gov.uk\/private-renting\/houses-in-multiple-occupation\" rel=\"noopener nofollow\" target=\"_blank\">make it a House of Multiple Occupation (HMO)<\/a>. This will, however, require a license. Broadly speaking, your property is an HMO if:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Five people or more, each from different households, are renting it out (a good example is student accommodation)<\/li>\n<li>Some or all of the tenants share kitchen facilities or a bathroom<\/li>\n<\/ul>\n<p>Even if your property is rented to fewer people than five it may still be an HMO, so you’ll need to contact your local council to check. In fact, it’s a good idea to speak to your council anyway, and inform them of your plans to become a landlord in case there are any local stipulations or rules you need to know about.<\/p>\n<h4>Will I need insurance as a landlord?<\/h4>\n<p>It’s likely you’ll have insurance on the primary property you live in, but this won’t cover a property that’s rented out. For that, you need special landlords’ insurance.<\/p>\n<p>Your mortgage provider is likely to require you to have building insurance from the outset, but you’ll also want contents insurance, especially for damage to big-ticket items like white goods, carpets and curtains.<\/p>\n<p>These days you can even get insurance that covers you if your tenants can’t pay the rent. Plus, it’s well worth getting emergency cover too, just in case of a major electrical failure or water leak.<br \/>\n&nbsp;<\/p>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/property-accountants\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Property accountancy services<\/h3>\n<p style=\"font-size: 1rem;\">Accounting for landlords and investors from £24.50 per month<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>How much can I charge in rent?<\/h3>\n<p>Searching websites like Rightmove, Zoopla and OnTheMarket is a great way to see how much other local landlords are charging for similar properties.<\/p>\n<p>When considering your prices, you’ll also need to decide what return on investment you’re looking for. Also ask yourself if you have enough money to cover property maintenance and mortgage repayments for any periods the property is unoccupied.<\/p>\n<h3>Do I need to pay tax on rental income?<\/h3>\n<p>Any profit you make after expenses will be subject to tax, so you’ll need to submit a tax return to HMRC in order to declare your profits. The <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/what-type-of-tax-return-do-i-need-to-submit-2566.html\" rel=\"noopener\" target=\"_blank\">type of tax return that you submit<\/a> depends on how you own your property. For example, if receive income from the property which isn&#8217;t taxed &#8216;at source&#8217; (which is how wages are taxed by an employer) then you may need to <a href=\"https:\/\/www.theaccountancy.co.uk\/landlords\/self-assessment-tax-returns-for-landlords-245905.html\" rel=\"noopener\" target=\"_blank\">submit a Self Assessment tax return for your landlord income<\/a>.<\/p>\n<p>You’re able to reduce the amount of tax you pay by <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/claiming-for-business-expenses\" rel=\"noopener\" target=\"_blank\">claiming allowable expenses and offsetting them against your tax bill<\/a>. Allowable expenses could include letting agency fees, service charges, utility bills, council tax, accountant fees, insurance, and costs relating to finding new tenants. <\/p>\n<div class=\"blogbox\">Read our article <a href=\"https:\/\/www.theaccountancy.co.uk\/landlords\/should-i-own-my-property-through-a-limited-company-or-as-a-sole-trader-97458.html\" rel=\"noopener\" target=\"_blank\">‘Should I Own My Property Through a Limited Company or as a Sole Trader?’<\/a> to learn more about paying tax as a landlord.<\/div>\n<h3>What steps do I need to take to be a landlord?<\/h3>\n<p>Many landlords use letting agents to manage the tenancy and advertise when the property is vacant, but it’s useful to understand the process even if you do use their services. <\/p>\n<h4>Give your tenants a ‘How to Rent Guide’<\/h4>\n<p>The government has written a <a href=\"https:\/\/www.gov.uk\/government\/publications\/how-to-rent\" rel=\"noopener\" target=\"_blank\">How to Rent Guide<\/a> which tenants must receive at the start of the tenancy. It helps private sector landlords and tenants get to grips with their rights and responsibilities, so it’s useful for both parties.<\/p>\n<p>If you don’t provide this, you could find it difficult to start any legal action if needed further down the road.<\/p>\n<h4>Understand about gaining access to your rental property<\/h4>\n<p>Yes, it’s your property but that doesn’t mean you can come and go unannounced. Sometimes however, landlords do need access to make repairs and undertake maintenance. <\/p>\n<p>If this is the case, you should give your tenants a minimum of 24 hours’ notice. And even if you have a key, don’t just wander in!<\/p>\n<p>Of course, if water is randomly gushing from somewhere then 24 hours’ notice may not be practical, but you should still let your tenants know when you’re on your way.<\/p>\n<p>Thinking about maintenance, keep major works down to a minimum if possible. Bear in mind that if any remedial work is exceptionally disruptive, tenants are within their rights to request a temporary reduction in their rent. This is called a ‘rent abatement’.<\/p>\n<h4>Obtain an EPC inspection<\/h4>\n<p>Next on your landlord-ing list should be <a href=\"https:\/\/www.gov.uk\/government\/publications\/energy-performance-certificates-for-the-construction-sale-and-let-of-dwellings\" rel=\"noopener\" target=\"_blank\">getting an energy performance certificate (EPC) inspection<\/a>. EPCs are a crucial part of making your property ready to rent. They look at how energy efficient it is, helping to you see where improvements are needed.<\/p>\n<p>Once the inspection is finished, your property will be awarded a grade from A to G. A is the most energy efficient (a big draw for potential bill-conscious renters!) whilst G is the least efficient. You’ll need a new EPC certificate every 10 years.<\/p>\n<div class=\"actionbox\">The very minimum you need to let a property is an EPC rating of E.<\/div>\n<h4>Gas and electrical safety checks for landlords<\/h4>\n<p>Your property must, by law, have safe gas and electric supplies (and appliances) if you wish to rent it out.<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li><strong>For gas:<\/strong> This means getting a GasSafe registered engineer to carry out a gas safety check every year. A copy of the certificate should be passed on to new tenants, and any repairs completed before they move in.<\/li>\n<li><strong>For electricity:<\/strong> UK regulations state that landlords must obtain an electrical inspection every five years. Any maintenance works the report throws up should be finished within 28 days, and your electrician must provide written confirmation. Once complete, an Electrical Installation Condition Report (EICR) will also be issued.<\/li>\n<\/ul>\n<p>If you’re including any electrical appliances for tenants to use, <a href=\"https:\/\/www.nrla.org.uk\/resources\/energy-efficiency\/pat-testing\" rel=\"noopener\" target=\"_blank\">they must be PAT tested<\/a>.<\/p>\n<h4>Fit (and maintain) carbon monoxide and smoke detectors<\/h4>\n<p>This is another safety requirement that’s absolutely essential legally. Landlords must fit and maintain both carbon monoxide alarms and smoke detectors. This is particularly the case where a property has fixed appliances such as gas fires or boilers.<\/p>\n<p>The rules apply to England and Wales but are slightly different <a href=\"https:\/\/www.gov.scot\/publications\/carbon-monoxide-alarms-in-private-rented-properties-guidance\/\" rel=\"noopener\" target=\"_blank\">for landlords in Scotland<\/a>.<\/p>\n<h4>Check any furniture meets fire safety regulations<\/h4>\n<p>All furnishings in the property must be fire resistant under the furniture and furnishings regulations act (1988). It’s not unheard of for landlords to be heavily fined, or even go to prison, if fire safety regulations are ignored.<br \/>\n<center><img decoding=\"async\" style=\"max-width: 600px; width: 100%;\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Landlord-Checklist.svg\" alt=\"Landlord Checklist\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" class=\"lazyload\" \/><\/center><\/p>\n<h4>Understand your maintenance responsibilities<\/h4>\n<p>Besides keeping your property on the right side of health and safety regulations, you also need to keep it in good condition. As a minimum, this involves carrying out repairs to:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>The structure of the property and any additional buildings like garages<\/li>\n<li>The heating and hot water system<\/li>\n<li>Toilets, sinks, baths, and other sanitaryware<\/li>\n<li>Any built-in kitchen appliances<\/li>\n<li>Common areas if the property is a flat or apartment<\/li>\n<\/ul>\n<p>Landlords must also fix any damage done by the tenant(s) or by themselves whilst making repairs.<\/p>\n<h4>Check your tenants actually have the right to rent<\/h4>\n<p>Only people over the age of 18 can legally rent a property so you (or your letting agency if using one) need to see ID. <a href=\"https:\/\/www.gov.uk\/check-tenant-right-to-rent-documents\" rel=\"noopener\" target=\"_blank\">Check your tenant’s right to rent on Gov.uk<\/a> for more information.<\/p>\n<h4>Carry out tenant reference checks<\/h4>\n<p>Tenants should be able to demonstrate their income and their right to reside in the UK, but it’s understandable that you might want a tenant you feel is more likely to look after the place. <\/p>\n<p>These checks are done by either landlords or, more commonly their agencies, and are known as tenant referencing.<\/p>\n<h4>Checking proof of income for potential tenants<\/h4>\n<p>When checking proof of income, prioritise tenants with at least three times the rent as their monthly income. For example, if you’re planning to charge £500 per month, their take-home pay should be around £1,500 a month.<\/p>\n<p>You also need to know your tenant’s credit history and whether they have any debt. Credit check companies like Experian are your friend. If the tenant doesn’t pass the credit check but you’d still like to rent to them, you could request they provide a guarantor.<\/p>\n<p>Finally, think of it like a job interview. Get references from current and previous employers as well as any prior landlords. Only sign on the dotted line when you’re absolutely sure.<\/p>\n<h4>Draw up a tenancy agreement<\/h4>\n<p>This is a rental contract and both you and your tenants must sign. If you’re doing this yourself, <a href=\"https:\/\/www.gov.uk\/government\/publications\/model-agreement-for-a-shorthold-assured-tenancy\" rel=\"noopener\" target=\"_blank\">you may find one of the online templates useful<\/a>. If you’re hiring a letting agency, they’ll sort this out for you.<\/p>\n<h4>Protect your tenant’s deposit<\/h4>\n<p>The vast majority of landlords require tenants to pay a deposit when they move in. This can help cover costs if they cause any damage, but the money must be held in a government-approved tenancy deposit protection (TDP) scheme – not in the landlord’s own bank account.<\/p>\n<p>The <a href=\"https:\/\/www.tenancydepositscheme.com\/\" rel=\"noopener\" target=\"_blank\">Tenancy Deposit Scheme<\/a>, <a href=\"https:\/\/www.depositprotection.com\/\" rel=\"noopener\" target=\"_blank\">Deposit Protection Service<\/a> and <a href=\"https:\/\/www.mydeposits.co.uk\/\" rel=\"noopener\" target=\"_blank\">MyDeposits<\/a> are popular ones but you must let your tenant know which scheme you’ve chosen.<\/p>\n<p>Security deposits can be no more than five weeks’ rent where the yearly rent is under £50,000. This cap is raised to six weeks’ rent if the yearly rent is more than £50,000.<\/p>\n<h4>Record inventory at your property<\/h4>\n<p>You need to have a record of what was in the property on the day the tenant moved in, and what condition it was in. Tenants should then be given the opportunity to check they’re happy with the inventory before they sign it.<\/p>\n<p>If any damage occurs during the course of their tenancy, the inventory will help you justify any deductions from their security deposit.<\/p>\n<p>&nbsp;<br \/>\n<em>Learn more about our online accounting services for businesses. Call 020 3355 4047 to chat to the team, and <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you’ve inherited a place or you’re considering a buy-to-let, renting out a property is a pretty big deal. Being a landlord&#8230;<\/p>\n","protected":false},"author":42,"featured_media":111754,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[830,36],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Whether you’ve inherited a place or you’re considering a buy-to-let, renting out a property is a pretty big deal. Being a landlord...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2024-01-15T10:00:30+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-11T08:53:54+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Beth-Anne Karellen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Beth-Anne Karellen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\"},\"author\":{\"name\":\"Beth-Anne Karellen\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa\"},\"headline\":\"Renting Out Your Property: A Checklist for Landlords\",\"datePublished\":\"2024-01-15T10:00:30+00:00\",\"dateModified\":\"2024-06-11T08:53:54+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\"},\"wordCount\":1990,\"commentCount\":2,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png\",\"articleSection\":[\"Landlords\",\"Tax\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\",\"name\":\"Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png\",\"datePublished\":\"2024-01-15T10:00:30+00:00\",\"dateModified\":\"2024-06-11T08:53:54+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png\",\"width\":1600,\"height\":740,\"caption\":\"Renting Out Your Property: A Checklist for Landlords\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa\",\"name\":\"Beth-Anne Karellen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g\",\"caption\":\"Beth-Anne Karellen\"},\"description\":\"I'm an experienced and fully AAT and ACCA qualified accountant, who is enthusiastic about helping business owners succeed. I also love cooking and needlepoint (at different times!). Learn more about Beth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/beth-anne-bruce\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html","og_locale":"en_GB","og_type":"article","og_title":"Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership","og_description":"Whether you’ve inherited a place or you’re considering a buy-to-let, renting out a property is a pretty big deal. Being a landlord...","og_url":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2024-01-15T10:00:30+00:00","article_modified_time":"2024-06-11T08:53:54+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png","type":"image\/png"}],"author":"Beth-Anne Karellen","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Beth-Anne Karellen","Estimated reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html"},"author":{"name":"Beth-Anne Karellen","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa"},"headline":"Renting Out Your Property: A Checklist for Landlords","datePublished":"2024-01-15T10:00:30+00:00","dateModified":"2024-06-11T08:53:54+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html"},"wordCount":1990,"commentCount":2,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png","articleSection":["Landlords","Tax"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html","url":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html","name":"Renting Out Your Property: A Checklist for Landlords | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png","datePublished":"2024-01-15T10:00:30+00:00","dateModified":"2024-06-11T08:53:54+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/landlords\/renting-out-your-property-a-checklist-for-landlords-110766.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/02\/Renting-Out-Your-Property-A-Checklist-for-Landlords.png","width":1600,"height":740,"caption":"Renting Out Your Property: A Checklist for Landlords"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa","name":"Beth-Anne Karellen","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g","caption":"Beth-Anne Karellen"},"description":"I'm an experienced and fully AAT and ACCA qualified accountant, who is enthusiastic about helping business owners succeed. I also love cooking and needlepoint (at different times!). Learn more about Beth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/beth-anne-bruce"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/110766"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/42"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=110766"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/110766\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/111754"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=110766"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=110766"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=110766"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}