{"id":13504,"date":"2023-02-16T10:55:32","date_gmt":"2023-02-16T10:55:32","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=13504"},"modified":"2024-06-13T11:56:33","modified_gmt":"2024-06-13T10:56:33","slug":"what-responsibilities-do-directors-have-in-a-limited-company","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/limited-company\/directors\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html","title":{"rendered":"What Responsibilities Do Directors Have in a Limited Company?"},"content":{"rendered":"<p>The directors in a limited company are normally responsible for managing and running the business. As a company director you might step in as a consultant from time-to-time, or be involved on a daily basis &#8211; it all depends on the company&#8217;s structure and what both you and the business need from the arrangement. <\/p>\n<p>A company directors&#8217; responsibilities and obligations can also vary, so in this article we go over what to expect as a minimum, and what else you might need to think about.<\/p>\n<h3>What is a limited company?<\/h3>\n<p>A limited company is a business which is legally separate to its owners. It’s <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/should-i-register-myself-as-a-sole-trader-or-a-limited-company-45326.html\" rel=\"noopener\" target=\"_blank\">a different type of structure to being a sole trader<\/a> or partnership, with different rules and requirements to follow.<\/p>\n<div class=\"actionbox\">Private limited companies are registered with Companies House, making things like director details and financial information publicly available.<\/div>\n<p>&nbsp;<br \/>\nThe main feature of a limited company is that its owners have limited liability should the company go bust. On the other hand, a sole trader and their business is effectively one and the same, so any debts or financial trouble could mean selling personal assets to bail out the business. With a limited company, owners and shareholders are protected from that worry.<\/p>\n<p>The flip side of this is that there’s usually more admin involved in running a limited company. You might find our blog on <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/the-advantages-and-disadvantages-of-operating-as-a-limited-company-14752.html\" rel=\"noopener\" target=\"_blank\">The Advantages and Disadvantages of Operating as a Limited Company<\/a> useful here.<\/p>\n<p>So, whose job is it to run the company? That would be a company director.<\/p>\n<h3>Who can be a company director?<\/h3>\n<p>Company directors are responsible for running the business and taking care of things like <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/company-tax-returns-and-corporation-tax-3746.html\" rel=\"noopener\" target=\"_blank\">the Company Tax Return<\/a>, so it’s important that they’re capable of carrying out their duties.<\/p>\n<p>Limited companies do need to have at least one director who is a ‘natural’ person – that is, an actual human individual – at all times, from incorporation onwards.<\/p>\n<p>That person might be the only director, <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#do-i-need-other-directors-to-form-a-private-limited-company\" rel=\"noopener\" target=\"_blank\">or there might be others<\/a> &#8211; directors can even be other corporate entities. For instance, a partnership, or even another limited company.<\/p>\n<p>A company director who is a natural person must:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Be aged 16 or older<\/li>\n<li>Not be disqualified from being a director<\/li>\n<\/ul>\n<p>You don’t need to live in the UK to be the director of a UK business, but the company will need to have <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/what-details-should-a-company-provide-on-its-stationery-and-website-14772.html\" rel=\"noopener\" target=\"_blank\">a UK registered office address<\/a>.<br \/>\n&nbsp;<\/p>\n<p><a href=\"\/who-we-help\/limited-company-accountants\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Limited company accountancy services<\/h3>\n<p>From only £54.50 per month<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>Are there different types of company director?<\/h3>\n<p>In legal terms all company directors are the same, and as such will need to appear on the public register available through Companies House. For internal management purposes though, you might decide to appoint a combination of “executive” and “non-executive” directors.<\/p>\n<p>Non-executive directors don’t get involved in the daily running of the business. Instead, they might sit on the board on a part-time <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/whats-the-most-tax-efficient-directors-salary-in-2022_23-51622.html\" rel=\"noopener\" target=\"_blank\">salaried basis<\/a> and take part in high-level strategic decisions.<\/p>\n<div class=\"actionbox\">Once a director is appointed, Companies House must be given the details within 14 days.<\/div>\n<p>&nbsp;<br \/>\nAn executive director might be more involved in the running of the business on a day-to-day basis. If there are multiple directors, you&#8217;ll normally appoint someone to be the <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/can-a-company-have-two-managing-directors-14737.html\" rel=\"noopener\" target=\"_blank\">Managing Director<\/a>. <\/p>\n<h3>What do company directors do?<\/h3>\n<p>As the director of a limited company, you might be working by yourself in a business which you own, in which case, you’re pretty much doing everything!<\/p>\n<p>In some companies there might be several directors who each take responsibility for a specific area of the business, such as financial management, marketing, or research. Overall, though, there are some responsibilities which are shared by all directors.<br \/>\n&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/k0Ui47Pfrwg?si=CJL9E30U9FcByurD\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h4>Know the financial health of their company<\/h4>\n<p>It’s really important that you understand the financial health of your company if you’re going to be an effective company director. That’s because the greater your awareness, the better able you’ll be to <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-do-i-make-better-business-decisions-44547.html\" rel=\"noopener\" target=\"_blank\">make informed decisions about financial risks and opportunities<\/a>, as well as where the company is headed.<\/p>\n<p>Directors should also take the time to regularly look over the company’s financial statements, such as <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/balance-sheet-58501.html\" rel=\"noopener\" target=\"_blank\">balance sheet reports<\/a>, and <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cash-flow-in-business-60140.html\" rel=\"noopener\" target=\"_blank\">cash flow forecasts<\/a>.<\/p>\n<p>A good understanding of the company’s key financial ratios is also essential here if you’re a company director. This includes the current ratio and debt-to-equity ratio, which can give a handy insight into the liquidity and financial stability of the business.<\/p>\n<p>Additionally, directors should know if there’s been any change in the company’s financial performance recently. For example, has revenue suddenly increased or dropped? Are there any new or substantial debts? Only then can any trends be identified, helping to inform important business decisions.<\/p>\n<div class=\"blogbox\">Learn more about <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/using-financial-reports-in-your-business-63750.html\" rel=\"noopener\" target=\"_blank\">using financial reports<\/a> to help you make business decisions.<\/div>\n<h4>Act in the best interests of the company<\/h4>\n<p>UK law outlines certain things you must legally do as a company director. The first is you must act in the best interests of the company at all times, avoiding any conflicts of interest wherever possible.<\/p>\n<p>Company directors are also expected to put their personal interests second to the company and shouldn’t favour a particular group of shareholders over any others.<\/p>\n<h4>Put corporate governance front and centre<\/h4>\n<p>If a company is going to be run effectively and ethically it needs to have good corporate governance. This means company directors should know what the company’s governance framework looks like and make sure it’s always put into practice.<\/p>\n<p>So, what is corporate governance we hear you ask. Well, corporate governance is basically a series of processes, practices and rules that are used in directing and controlling a company &#8211; these are often detailed in <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/what-are-model-articles-of-association-in-a-limited-company-196848.html\" rel=\"noopener\" target=\"_blank\">the company&#8217;s articles of association<\/a>. It aims to get a good balance between the interests of all the different company stakeholders, including shareholders, directors, managers and staff.<\/p>\n<div class=\"actionbox\">Corporate governance also takes into account the requirements of the general public and the government too.<\/div>\n<p>&nbsp;<br \/>\nThe company’s corporate governance framework should also be considered during decision-making processes and in board meetings. Again, it’s all about making sure you’re acting in the best interests of the company and its stakeholders.<\/p>\n<p>By being aware of any upcoming risks and anticipating any challenges, the company stands a much better chance of long-term sustainability and success. It’s not an easy role to take on – you need to be really committed and dedicated, with excellent judgement.<\/p>\n<h4>Manage risks<\/h4>\n<p>This leads on nicely from the point above about having good foresight and judgement. Companies face risks all the time. These can be operational, legal or financial (or something totally out of left field!) and can also involve compliance issues.<\/p>\n<p>As a company director, you’re responsible for understanding company risks, and how to best mitigate them. In a larger business this might mean working with the other directors and\/or managers, but even in a business where you’re the sole director, you can implement internal controls, policies, and procedures. It might sound like a lot of extra work, but in reality, it should be fairly straightforward, and it can help you to stay consistent.<\/p>\n<p>You might find that you need documentary evidence of your policies and procedures if you pitch for investment or <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/funding-options-for-small-businesses-36678.html\" rel=\"noopener\" target=\"_blank\">apply for loans or funding<\/a>.<\/p>\n<h4>Staying in touch with the outside world<\/h4>\n<p>We get it, you’ve got your head down, grafting away, but it&#8217;s also important that company directors stay clued up on any changes or updates in the industry, as well as external factors that could affect the business.<\/p>\n<p>It will help you identify areas that may need a little attention and come up with contingency plans that address those risks. These might be new competitors in the marketplace, potential supply chain issues, or beyond to full-blown emergencies.<\/p>\n<p>This last one will go back to the previous point about managing risks in your company. For instance, what emergency events could affect the business and how would they be dealt with to get back up and running ASAP?<\/p>\n<p>Might this also mean that you need to assess your health and safety procedures, or that you need <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/how-to-protect-your-small-business-from-phishing-scams-and-fraud-36805.html\" rel=\"noopener\" target=\"_blank\">fraud prevention protocols<\/a>? These are all things which may seem unlikely, but that could really damage your business if not mitigated properly.<\/p>\n<h4>Compliance with laws and regulations<\/h4>\n<p>When you’re a company director, you need to be aware of all the laws and regulations that affect your company. You’re responsible for implementing them! This is really important, because failing to stay on the right side of the law can damage your company’s reputation (not to mention fines and possible prison sentences in some cases).<\/p>\n<p>The scope of relevant laws and regulations is often very wide-ranging. They include data protection, health and safety, <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/new-employers-guide\" rel=\"noopener\" target=\"_blank\">recruitment and employment rights<\/a>, environmental protection, discrimination and much more. Ignorance is definitely not bliss here, so get professional advice where needed. And yes, this includes your statutory reporting requirements, <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/obligations-and-deadlines-for-limited-companies\" rel=\"noopener\" target=\"_blank\">such as tax returns and annual accounts<\/a>!<\/p>\n<p>You should also have water-tight systems in place to monitor compliance. This will include training your staff and taking action where any non-compliance is found.<\/p>\n<h4>Effectively lead and manage the company<\/h4>\n<p>Being a company director isn’t always a walk in the park. Ultimately the buck stops with you when it comes to making strategic decisions that affect the company on every level. Sometimes these decisions won’t make you very popular, but it’s an important responsibility that comes with the role.<\/p>\n<p>As a company director, you’re also a key player in setting the direction of the company and managing its performance. You’ll need to set goals and objectives, allocate resources, and make decisions about new business ventures or products <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-write-the-perfect-business-plan-25798.html\" rel=\"noopener\" target=\"_blank\">according to your business plan<\/a>. <\/p>\n<p>You&#8217;ll need a business plan! Not only that, but you’ll also be responsible for managing the company’s operations, finances, and <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/managing-your-spending-budget-in-your-business-5122.html\" rel=\"noopener\" target=\"_blank\">budget setting<\/a>.<\/p>\n<h4>Communicate with stakeholders<\/h4>\n<p>The term ‘stakeholder’ basically refers to anyone with a business interest in the company. It’s a broad brush, with stakeholders including other company directors, managers, shareholders, customers, employees, and suppliers. Effectively communicating with all of them is essential if your business is going to succeed.<\/p>\n<p>Company directors need to be proactive in their communication with stakeholders, keeping them updated on the company’s performance, operations and future plans. Not only does this increase trust in your brand but boosts your credibility too. It also helps to identify any issues or concerns that crop up.<\/p>\n<p>There are many ways for directors to communicate with stakeholders, for example through the company website, mailshots, newsletters, meetings and annual reports. It’s also important to listen to what your stakeholders value in the company and get their input when you make decisions.<\/p>\n<h3>What happens if these responsibilities aren’t taken seriously?<\/h3>\n<p>Under the Companies Act 2006 directors can be liable if they do not carry out some of these responsibilities effectively. As mentioned, this could bring about hefty fines &#8211; or worse &#8211; not to mention damage to the company’s reputation.<\/p>\n<p>Even if you’re the only director in your business, you don’t have to do everything alone. Ask for help from appropriate reliable sources when you need it!<\/p>\n<p>&nbsp;<br \/>\n<em>Have you just started your own company? Maybe you’re looking <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company-formations\" rel=\"noopener\" target=\"_blank\">to register your business<\/a>? Talk to us about keeping on top of your financial responsibilities with the help of our team. Give us a call on 020 3355 4047, or <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The directors in a limited company are normally responsible for managing and running the business. As a company director you might step&#8230;<\/p>\n","protected":false},"author":42,"featured_media":67644,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[806,560,21,28],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"The directors in a limited company are normally responsible for managing and running the business. As a company director you might step...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2023-02-16T10:55:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-13T10:56:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Beth-Anne Karellen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Beth-Anne Karellen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\"},\"author\":{\"name\":\"Beth-Anne Karellen\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa\"},\"headline\":\"What Responsibilities Do Directors Have in a Limited Company?\",\"datePublished\":\"2023-02-16T10:55:32+00:00\",\"dateModified\":\"2024-06-13T10:56:33+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\"},\"wordCount\":1929,\"commentCount\":1,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png\",\"articleSection\":[\"Directors\",\"Limited Company\",\"Self Employed\",\"Small Business\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\",\"name\":\"What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png\",\"datePublished\":\"2023-02-16T10:55:32+00:00\",\"dateModified\":\"2024-06-13T10:56:33+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png\",\"width\":1600,\"height\":740,\"caption\":\"Limited Company Director’s Responsibilities for a UK Business\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa\",\"name\":\"Beth-Anne Karellen\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g\",\"caption\":\"Beth-Anne Karellen\"},\"description\":\"I'm an experienced and fully AAT and ACCA qualified accountant, who is enthusiastic about helping business owners succeed. I also love cooking and needlepoint (at different times!). Learn more about Beth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/beth-anne-bruce\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html","og_locale":"en_GB","og_type":"article","og_title":"What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership","og_description":"The directors in a limited company are normally responsible for managing and running the business. As a company director you might step...","og_url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2023-02-16T10:55:32+00:00","article_modified_time":"2024-06-13T10:56:33+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png","type":"image\/png"}],"author":"Beth-Anne Karellen","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Beth-Anne Karellen","Estimated reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html"},"author":{"name":"Beth-Anne Karellen","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa"},"headline":"What Responsibilities Do Directors Have in a Limited Company?","datePublished":"2023-02-16T10:55:32+00:00","dateModified":"2024-06-13T10:56:33+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html"},"wordCount":1929,"commentCount":1,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png","articleSection":["Directors","Limited Company","Self Employed","Small Business"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html","url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html","name":"What Responsibilities Do Directors Have in a Limited Company? | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png","datePublished":"2023-02-16T10:55:32+00:00","dateModified":"2024-06-13T10:56:33+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2018\/07\/Limited-Company-Directors-Responsibilities-for-a-UK-Business.png","width":1600,"height":740,"caption":"Limited Company Director’s Responsibilities for a UK Business"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/905debb5f8ab9bcfd329a0edef40caaa","name":"Beth-Anne Karellen","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/df78694402b38d8bdc30ac329cc45f34?s=96&d=mm&r=g","caption":"Beth-Anne Karellen"},"description":"I'm an experienced and fully AAT and ACCA qualified accountant, who is enthusiastic about helping business owners succeed. I also love cooking and needlepoint (at different times!). Learn more about Beth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/beth-anne-bruce"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/13504"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/42"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=13504"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/13504\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/67644"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=13504"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=13504"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=13504"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}