{"id":14274,"date":"2023-07-02T09:00:15","date_gmt":"2023-07-02T08:00:15","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=14274"},"modified":"2024-06-12T14:15:27","modified_gmt":"2024-06-12T13:15:27","slug":"mental-health-and-wellbeing-for-the-self-employed","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/mental-health\/mental-health-and-wellbeing-for-the-self-employed-14274.html","title":{"rendered":"Mental Health and Wellbeing for the Self-Employed"},"content":{"rendered":"<p>There’s no escaping the fact that running your own business can be stressful at times, with extra responsibilities that might not otherwise appear on your radar whilst working for someone else.<\/p>\n<p>With so much going on, it’s all too easy to feel like you should always be doing something, making it difficult to switch-off from your to-do list. There’s a real risk of becoming so absorbed by the business that it gets difficult to work out where your sense of self-worth ends, and the business begins.<\/p>\n<p>In this article we share some tips for recognising business burnout, and practical steps to easing self-employed stress.<\/p>\n<h3>How to recognise business burnout<\/h3>\n<p>Burnout can crop up out of nowhere, and you might not even realise that you’ve been feeling stressed until, suddenly, the idea of running your business is just too much.<\/p>\n<div class=\"actionbox\">If it’s already happened, please know that you are not alone. There are people that can help you.<\/div>\n<p>&nbsp;<br \/>\nRecognising the warning signs can help you make the best possible decisions for your business and for your mental health. They’re not always that easy to spot, but <a href=\"https:\/\/www.theaccountancy.co.uk\/business-news\/the-sme-business-owner-mental-health-report-chapter-one-96974.html#MostDetrimental\" rel=\"noopener\" target=\"_blank\">potential indicators might include<\/a>:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Feeling like you’re going through the motions, without actually progressing<\/li>\n<li>Prioritising the business over your own wellbeing<\/li>\n<li>Feeling overwhelmed, even by tasks which you might normally find simple<\/li>\n<li>Dreading the day ahead<\/li>\n<li>Regularly missing meals, or other changes to eating habits such as comfort eating<\/li>\n<li>Needing to replace sleep with stimulants such as caffeine, or feeling like you need alcohol or other substances to help you relax<\/li>\n<li>Becoming withdrawn from friends, family, or business partners<\/li>\n<li>Racing thoughts<\/li>\n<li>Constantly feeling bored with what you’re working on, and like you should be moving on to the next task<\/li>\n<\/ul>\n<p>If you identify with any of these, it might be time to take a moment and assess what options you have to alleviate the symptoms. The crucial thing here is that no matter how much strain you’re under, you do have options. And we’ll say it again – you are not alone.<\/p>\n<h3>Seasonal survivalism for business owners<\/h3>\n<p>Lots of businesses have seasonal fluctuations where demand is higher at some times of the year than at others. But what about your body? If you’re one of those people whose patience and motivation gets shorter as the daylight hours do, then you could very well be dealing with a case of Seasonal Affective Disorder (SAD).<\/p>\n<p>SAD is a clinically acknowledged condition which emerges at the end of autumn and lasts through winter. That time when the days are shorter, mornings darker, temperatures drop, and everything just seems a bit, you know… drab.<\/p>\n<p>Nobody likes crawling out of their warm bed when it’s still pitch-black outside, but SAD runs deeper than that. The condition is caused by a hormonal imbalance which occurs as the lack of daylight causes a hike in melatonin and a dip in serotonin levels.<\/p>\n<p>Serotonin is the hormone which helps regulate mood and keep us happy, while melatonin is the hormone which makes us feel sleepy (hence the feeling of complete and utter exhaustion attached to SAD).<\/p>\n<p>Aside from lethargy and super low energy levels, some other common symptoms of Seasonal Affective Disorder include:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Low mood<\/li>\n<li>Lack of motivation<\/li>\n<li>Difficulty concentrating<\/li>\n<li>Insomnia or broken sleep<\/li>\n<li>Sudden changes to your weight<\/li>\n<li>No desire to socialise with colleagues, friends, or family<\/li>\n<\/ul>\n<p>It can be a rough time, with a serious impact on your productivity. The <a href=\"https:\/\/www.nhs.uk\/mental-health\/conditions\/seasonal-affective-disorder-sad\/overview\/\" rel=\"noopener nofollow\" target=\"_blank\">NHS website suggests some treatments<\/a> that might help.<\/p>\n<h3>Combatting loneliness when you work for yourself<\/h3>\n<p>Being your own boss can be an incredibly empowering feeling. The less enjoyable flip side of independence can be a sense of isolation, where you’re the one making all the decisions, doing the work, and running the show.<\/p>\n<p>If you find yourself needing some social contact during the working day, you might be able to:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Use a co-working space, such as a desk, office, or a workshop<\/li>\n<li>Get a change of scenery, even if it’s just means taking your laptop to a coffee shop<\/li>\n<li>Visit clients or have meetings face-to-face sometimes, or set up video calls rather than emailing<\/li>\n<li>Attend networking events, trade shows, or other industry fixtures<\/li>\n<li>Get involved with collaborative projects<\/li>\n<\/ul>\n<h3>Looking after your physical health while running a business<\/h3>\n<p>It can be hard to remain healthy when you’re busy building an empire, but looking after yourself is crucial if you’re to be in top form to make the business a success. We tend to think of physical and mental health as separate things, but they can affect each other so profoundly that they’re indivisible.<\/p>\n<p>It’s important to get good sleep, stay hydrated and eat regular, healthy meals (making sure you sit down long enough to chew what you’re eating and digest it).<\/p>\n<p>Exercise is also important for reducing stress, as it releases feel-good endorphins and helps to regulate blood sugar levels, aside from all its other positive effects (lowering blood pressure and reducing the risk of heart attacks, strokes, type 2 diabetes, and some cancers).<\/p>\n<p>If you spend all day sitting at a desk or standing at a workbench, remember to take time to move around and ease off those muscles. <\/p>\n<h3>Stress relief for small business owners<\/h3>\n<p>There is no universal fix when our mental health starts to suffer, but there are lots of options to explore, and some coping mechanisms which will help.<\/p>\n<h4>Talk to a confidante or professional<\/h4>\n<p>Sometimes the worst part of a stressful situation is feeling alone and anxious, but bottling up your emotions can be really hard on both your mental and physical health. Even though it sounds too simple to be effective, when you take the time to verbalise your stress, some of the tension can ease. You do not have to do this alone.<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li><a href=\"https:\/\/www.mentalhealthatwork.org.uk\/toolkit\/mental-health-for-small-workplaces\/\" rel=\"noopener nofollow\" target=\"_blank\">Mental Health at Work<\/a><\/li>\n<li><a href=\"https:\/\/www.mind.org.uk\/\" rel=\"noopener nofollow\" target=\"_blank\">Mind<\/a><\/li>\n<li><a href=\"https:\/\/www.samaritans.org\/\" rel=\"noopener nofollow\" target=\"_blank\">Samaritans<\/a><\/li>\n<\/ul>\n<p>Make sure you have an outlet, away from the business, where you can be authentic and genuine. If you’re worried about passing your concerns on to those around you, particularly if it relates to financial security, talk to someone independent such as a professional counsellor.<\/p>\n<h4>Set time aside for yourself each day<\/h4>\n<p>Of course, you always want to go that extra mile for your customers and spend the remaining time chasing new business, but that shouldn’t happen at the expense of your wellbeing.<\/p>\n<p>No matter how demanding your to-do list is, there’s always time to squeeze in a breather for yourself. Even better, don’t just squeeze it in, schedule it.<\/p>\n<p>Something as simple as breathing exercises can make a huge difference to the rest of your day and stop you from snapping at a colleague or getting angry at a late order.<\/p>\n<p>It can even help you be more productive, allowing your brain time to assimilate information and come up with new ideas.<\/p>\n<h4>Make time for family and friends<\/h4>\n<p>Running your own business can seem all-encompassing, and at the beginning, it will probably take up a lot of your time. But, as well as taking time for yourself, take time for the people you care about.<\/p>\n<p>If you work with family members, agree to leave work problems behind once your ‘office hours’ are over, and have ‘no work-talk’ boundaries.<\/p>\n<h4>Accept that you can’t do everything<\/h4>\n<p>You may be a great marketer. You may know everything about every car you sell from your forecourt, or every quality control test your company offers.<\/p>\n<p>But perhaps you’re not sure how to get the multifunction printer to do that clever back-to-back, gatefold staple printing it does, or how to fill in your tax return.<\/p>\n<p>That’s fine. None of us are experts at everything, and trying to do it all is a definite source of stress. Accept you can’t, and find someone who can. <\/p>\n<p>The good news is that outsourcing the work or <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/new-employers-guide\" rel=\"noopener\" target=\"_blank\">employing staff<\/a> is usually an allowable expense that you can use to claim tax relief. <\/p>\n<div class=\"blogbox\">See our <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/claiming-for-business-expenses\" rel=\"noopener\" target=\"_blank\">guide to business expenses<\/a> to learn more.<\/div>\n<h4>Make mindful, well-informed decisions<\/h4>\n<p>Decision-making can be a surprisingly difficult skill to master, particularly when you’re feeling under pressure. It sounds obvious, but a logical approach can help take some of the stress out of the process.<\/p>\n<p>For instance, referring to your business’s financial reports (sometimes called ‘<a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/using-financial-reports-in-your-business-63750.html\" rel=\"noopener\" target=\"_blank\">management accounts<\/a>’) on a regular basis will help you to prioritise spending more efficiently.<\/p>\n<h4>Planning and preparation is the ultimate business power move<\/h4>\n<p>Most entrepreneurs will recognise the value of a good list. They can help you prioritise your time and get everything done efficiently, which is important when you have a business to run. If you’ve been experiencing feelings of anxiety or low mood, then planning ahead can help you feel more in control.<\/p>\n<h5>Keep on top of your business plan<\/h5>\n<p>The obvious place to start <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-write-the-perfect-business-plan-25798.html\" rel=\"noopener\" target=\"_blank\">is with your business plan<\/a>. Is it still up to date, or does it need a refresh? If it’s still current, are you focusing your efforts on the right things, or are you tiring yourself out on the ‘nice to haves’?<\/p>\n<p>Be realistic with what you can achieve, so that you don’t set unachievable goals or waste resources.<\/p>\n<h5>Review your processes and systems<\/h5>\n<p>Once you have the bigger picture in place, it’s time to reassess your methods. If you’re feeling overwhelmed and all over the place, it’s definitely worth taking the time to look at your workflow. For example, are there more efficient ways of planning projects, managing teams, or communicating with clients?<\/p>\n<h5>Make sure your books are in order<\/h5>\n<p>One of the leading causes of stress is money and finances. This can be bad enough in your personal life, so trying to deal with your business’s accounting can make the stakes a lot higher. <\/p>\n<p>Good <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">bookkeeping software<\/a> will help to ease a lot of the admin burden, and a good accountant will help with the ‘can I do this?’ terror that lots of business owners feel. They’ll also make sure you’re getting all the <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/tax-relief\/tax-relief-for-the-self-employed-3833.html\" rel=\"noopener\" target=\"_blank\">tax relief that you’re entitled to<\/a> (and the fees are an allowable expense too). <\/p>\n<h5>Have a single calendar<\/h5>\n<p>If you carry a small diary around, be disciplined about transferring notes to your main calendar. Unless you’re a technophobe, the best solution is to have an online calendar that you can access and sync from your phone and all your other devices.<\/p>\n<p>Set automated reminders to remind you of events, tasks, <a href=\"https:\/\/www.theaccountancy.co.uk\/key-accounting-and-tax-year-dates\" rel=\"noopener\" target=\"_blank\">tax return deadlines<\/a>, and appointments before they happen. It’s no good receiving a notification that your meeting in Leeds is due to start if you’re three hours away, or that your Company Tax Return is due tomorrow.<\/p>\n<h5>Compartmentalise your time – and your space<\/h5>\n<p>It’s far too easy to let work bleed over into your home life, particularly if your home is also your workplace. Try to establish working hours, and do your best to stick to them. <\/p>\n<p>If you do work from home, avoid letting business paperwork, equipment, and stock encroach on your living space. Try to keep it somewhere where you can shut the door on it!<\/p>\n<p>&nbsp;<br \/>\n<em>Learn more about our online accounting services for businesses. Call 020 3355 4047 to chat to the team, and <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>There’s no escaping the fact that running your own business can be stressful at times, with extra responsibilities that might not otherwise&#8230;<\/p>\n","protected":false},"author":14,"featured_media":15932,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[530,21],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"There’s no escaping the fact that running your own business can be stressful at times, with extra responsibilities that might not otherwise...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-02T08:00:15+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-12T13:15:27+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elizabeth Hughes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elizabeth Hughes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\"},\"author\":{\"name\":\"Elizabeth Hughes\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\"},\"headline\":\"Mental Health and Wellbeing for the Self-Employed\",\"datePublished\":\"2023-07-02T08:00:15+00:00\",\"dateModified\":\"2024-06-12T13:15:27+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\"},\"wordCount\":1894,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png\",\"articleSection\":[\"Mental Health\",\"Self Employed\"],\"inLanguage\":\"en-GB\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\",\"name\":\"Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png\",\"datePublished\":\"2023-07-02T08:00:15+00:00\",\"dateModified\":\"2024-06-12T13:15:27+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png\",\"width\":1600,\"height\":740,\"caption\":\"Running Your Own Business and Your Mental Health\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\",\"name\":\"Elizabeth Hughes\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"caption\":\"Elizabeth Hughes\"},\"description\":\"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html","og_locale":"en_GB","og_type":"article","og_title":"Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership","og_description":"There’s no escaping the fact that running your own business can be stressful at times, with extra responsibilities that might not otherwise...","og_url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2023-07-02T08:00:15+00:00","article_modified_time":"2024-06-12T13:15:27+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png","type":"image\/png"}],"author":"Elizabeth Hughes","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Elizabeth Hughes","Estimated reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html"},"author":{"name":"Elizabeth Hughes","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362"},"headline":"Mental Health and Wellbeing for the Self-Employed","datePublished":"2023-07-02T08:00:15+00:00","dateModified":"2024-06-12T13:15:27+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html"},"wordCount":1894,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png","articleSection":["Mental Health","Self Employed"],"inLanguage":"en-GB"},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html","url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html","name":"Mental Health and Wellbeing for the Self-Employed | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png","datePublished":"2023-07-02T08:00:15+00:00","dateModified":"2024-06-12T13:15:27+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/mental-health-and-wellbeing-for-the-self-employed-14274.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/Running-Your-Own-Business-and-Your-Mental-Health.png","width":1600,"height":740,"caption":"Running Your Own Business and Your Mental Health"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362","name":"Elizabeth Hughes","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","caption":"Elizabeth Hughes"},"description":"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/14274"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=14274"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/14274\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/15932"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=14274"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=14274"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=14274"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}