{"id":160692,"date":"2022-10-17T15:00:41","date_gmt":"2022-10-17T14:00:41","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=160692"},"modified":"2024-06-14T09:34:49","modified_gmt":"2024-06-14T08:34:49","slug":"the-cost-of-living-crisis-survival-guide-for-small-businesses","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/small-business\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html","title":{"rendered":"The Cost-of-Living Crisis Survival Guide for Small Businesses"},"content":{"rendered":"<p>As the cost-of-living crisis grinds on, small businesses and sole traders are once again battling through tough times. Add to that an increasing number of both insolvencies and people taking on side hustles or second jobs to supplement their income, and it’s more important than ever that businesses can access advice and support.<\/p>\n<p>Read our guide to see what steps you can take to help your business survive the current economic climate. Every business is different, so we share some of the most frequently asked questions, and the most common issues that we encounter.<\/p>\n<h3>Start with your bookkeeping – it knows everything about your business<\/h3>\n<p>Apart from the fact that HMRC expect you to keep excellent financial records, <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">bookkeeping is at the heart of everything happening in your business<\/a>.<\/p>\n<p>Invoiced a customer? Record it in your bookkeeping. More importantly, include the details of what you sold, who to, when, how many, and so on. Then record whether or not they paid on time, what you spent money on to make the sale&#8230;<\/p>\n<p>You can probably see where we’re going, but it’s difficult to overstate just how useful this information is for a business. The more thorough and up to date your records are, the more reliable your bookkeeping and in turn, the more accurate your accounts.<\/p>\n<div class=\"blogbox\">Read our <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">Guide to Bookkeeping<\/a>  to learn more.<\/div>\n<h3>Review your financial reports<\/h3>\n<p>There’s a bit of a theme here, but good bookkeeping habits will help make sure that your financial reports are as accurate and detailed as possible when you need them. But why do you need them?<\/p>\n<h4>How can financial reporting help your business?<\/h4>\n<p>These reports can be very revealing about what’s really happening in your business. Sometimes known as ‘<a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/using-financial-reports-in-your-business-63750.html\" rel=\"noopener\" target=\"_blank\">management accounts<\/a>’, you can use different types of report to look at particular areas.<\/p>\n<div class=\"actionbox\">Having this information lets you make more well-informed decisions about what action to take.<\/div>\n<p>&nbsp;<br \/>\nFor example, looking at your <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/profit-and-loss-39421.html\" rel=\"noopener\" target=\"_blank\">Profit and Loss report<\/a> (you might also hear it called P&#038;L) shows what the business has left over once it pays its expenses for a particular time period. The results can be surprising – unpleasantly so if a high volume of sales doesn’t also mean lots of profit.<\/p>\n<p>In this scenario your next stop could be some up-to-date market research to see what competitors are charging &#8211; is it time to put your prices up? You could also go back to your financial reporting and see what it is that you’re spending money on which is eating into those profits.<br \/>\n&nbsp;<\/p>\n<p><a class=\"modal_button\" style=\"cursor: pointer;\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Online accountancy services<\/h3>\n<p>Get a quote and see how much you could be saving!<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Get an instant quote<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h4>Negotiate with your suppliers<\/h4>\n<p>If your business costs are getting away from you, then it might be <a href=\"https:\/\/www.theaccountancy.co.uk\/small-business\/negotiating-supplier-contracts-45561.html\" rel=\"noopener\" target=\"_blank\">time for a chat with your suppliers<\/a> – or to review who you’re working with entirely.<\/p>\n<p>Bartering can be something of an art, and not all of us feel entirely comfortable trying to negotiate (or re-negotiate) a contract. Your suppliers might be dealing with their own rising costs at the moment, but it never hurts to open a conversation or shop around for the best offers.<\/p>\n<h4>Review your spending<\/h4>\n<p>Most of us get stuck in a rut at some point, and our spending habits are no different. Difficult as it can be, it’s useful to look beyond the entry on your bank statement or financial report, and think about the extent to which a cost actually adds value to your business. Are you spending money on something out of habit alone, or is it <em>really<\/em> a necessary expense? <\/p>\n<h4>Manage your cash flow<\/h4>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cash-flow-in-business-60140.html\" rel=\"noopener\" target=\"_blank\">Cash flow<\/a> is all about how and when funds move in and out of your business. The timing of these events can put your business under stress, for example:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>You purchase materials to fulfil an order, and receive an invoice which is due within 30 days.<\/li>\n<li>The order is completed, and you invoice your client.<\/li>\n<li>You need to pay your supplier, but your client hasn’t paid you yet. Stress!<\/li>\n<\/ul>\n<p>It’s a very, very common problem, especially for tiny businesses who don’t have much in reserve as a buffer. Monitoring the timing of what’s coming in versus what’s going out can help you avoid unnecessary spending at pinch points. It might filter down to other parts of the business too, such as addressing <a href=\"https:\/\/thecheapaccountants.com\/tips-and-tactics-for-tackling-late-payments\/\" rel=\"noopener\" target=\"_blank\">how you tackle late payments<\/a>, or setting credit limits for customers.<\/p>\n<p>If this sounds like a lot of extra admin at a time when you&#8217;re already under stress, look into using bookkeeping software (like our very own <a href=\"https:\/\/www.theaccountancy.co.uk\/free-bookkeeping-software\" rel=\"noopener\" target=\"_blank\">Pandle<\/a>!) which can automate most of this for you. <\/p>\n<h3>Are you claiming tax relief?<\/h3>\n<p>There are several options for claiming tax relief, including offsetting your business expenses against your tax bill in various ways.<\/p>\n<h4>Are you claiming for your business expenses?<\/h4>\n<p>If you absolutely have to spend on something for your business, can you at least <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/claiming-for-business-expenses\" rel=\"noopener\" target=\"_blank\">claim tax relief on it<\/a>? Businesses pay tax on profit &#8211; what’s left after expenses &#8211; not on income. If you record all of your allowable expenses correctly (hello again, good bookkeeping) you’ll have all the details ready to offset against your tax bill, so you’ll pay less tax. It’s another win for meticulous bookkeeping.<\/p>\n<p>Unfortunately, HMRC do a good line in scary-sounding letters which, understandably, most businesses are anxious to avoid. As a result, <a href=\"https:\/\/www.theaccountancy.co.uk\/expenses\/what-do-small-business-owners-really-know-about-expenses-89539.html\" rel=\"noopener\" target=\"_blank\">huge numbers of businesses routinely miss out on claiming the tax relief they’re entitled to<\/a> because they&#8217;re worried about getting it wrong. Get advice if you need it!<br \/>\n&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/bSWAORAxSC8?si=7XvqbfB3X2hLYnUE\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h4>Have you made a loss that you can carry back?<\/h4>\n<p>Your financial records will also show whether you made a profit or a loss – this year, and in previous years. You can normally ‘carry back’ a loss for the previous 12-month period, so if you made a really good profit (and paid a lot of tax) one year, then a loss the next, you could carry back your loss to the previous year.<\/p>\n<p>This reduces the previous year’s profit, and therefore the amount of tax, so if you’ve already paid it, you’ll get a rebate – hurrah!<\/p>\n<p>In response to Covid, the loss carry-back scheme was extended to three years for:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Accounting periods ending between 1st April 2020 and 31st March 2022 if you’re a limited company<\/li>\n<li>The 2020\/21 and 2021\/22 tax years for unincorporated businesses (such as sole traders).<\/li>\n<\/ul>\n<div class=\"blogbox\">Learn more about <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/carry-back-rules-relief-for-trading-losses-on-corporation-tax-and-income-tax-83008.html\" rel=\"noopener\" target=\"_blank\">claiming tax relief under the carry-back rules<\/a>.<\/div>\n<h3>When was the last time you reviewed your business plan?<\/h3>\n<p>Beyond “launch business, make fortune, retire” your business plan is a useful document <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-write-the-perfect-business-plan-25798.html\" rel=\"noopener\" target=\"_blank\">which sets out what you’re aiming for<\/a>, and how you plan to get there.<\/p>\n<h4>What changes can I make?<\/h4>\n<p>Lots of entrepreneurs usually write a business plan before launching a start-up, but it’s just as important to review and update it regularly too.<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li><strong>Are your goals still the same?<\/strong> Perhaps you’ve already ticked them off and moved on to the next thing, or even changed direction altogether. Or you might be at the other end of the dial, and in danger of missing out on new opportunities because you’ve got your head down to focus on what&#8217;s in front of you.<\/li>\n<li><strong>Has the market changed?<\/strong> Do your customers still want the same things, and do they still shop for them in the same way? Changing trends could affect everything from the payment options you offer, to where you promote goods and services.<\/li>\n<li><strong>How do you promote your business?<\/strong> If you spend a lot of money on advertising (for example), is it worth it? Take advice if you’re not sure what options are available!<\/li>\n<li><strong>Are there areas you could generate income other than your main trade?<\/strong> For instance, a mobile hairdresser might also sell products. Someone with business premises might rent out unused space.<\/li>\n<li><strong>Do you still need to operate in the same way?<\/strong> Perhaps staff could work remotely. Maybe your route to market could change. Do any of your processes need to be streamlined?<\/li>\n<li><strong>Is everything going surprisingly well?<\/strong> Great! What will you need to do to keep it that way? Get your breath back, and go over everything again &#8211; there&#8217;s no room for complacency, and we don’t want any competitors sneaking up on you!<\/li>\n<\/ul>\n<p>There are lots of considerations, and this can make everything seem a bit too overwhelming. Break every part of your business down into manageable chunks, and decide a plan of action. That’s your new business plan right there.<\/p>\n<h3>Is there an area of your business you need to spend money on in order to become more productive?<\/h3>\n<p>The idea of voluntarily spending money when everyone’s bills are going up might seem counter-intuitive, but bear with us.<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Would some additional training help staff take on work which you can then charge out at a higher rate?<\/li>\n<li>Is there equipment in your workshop which could be replaced? Perhaps you’re at maximum capacity, and a new machine would help you increase the volume of your output so you can sell more?<\/li>\n<\/ul>\n<p>These are just two examples from a long list of possibilities, our point being to focus on the strengths of your business.<\/p>\n<p>Once you review your business and financial reports and find out what works particularly well, you might even find out that your strong points lie in a different direction to what you thought!<\/p>\n<h4>Funding options to help with growth<\/h4>\n<p>There are usually <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/funding-options-for-small-businesses-36678.html\" rel=\"noopener\" target=\"_blank\">growth grants<\/a> around in one form or another, though they can sometimes have quite specific eligibility criteria. They can pop up all over, from the local Chamber of Commerce to government funding schemes, or even sponsorship from industry.<\/p>\n<p>You can also find out more about support available for your home on the government&#8217;s <a href=\"https:\/\/helpforhouseholds.campaign.gov.uk\/\" rel=\"noopener\" target=\"_blank\">Help for Households<\/a> website.<\/p>\n<h4>Super deduction and capital allowances<\/h4>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/tax-relief\/capital-allowances\/the-beginners-guide-to-capital-allowances-127149.html\" rel=\"noopener\" target=\"_blank\">Capital allowances<\/a> are a type of tax relief which allow you to deduct an asset’s value from your profits which, in turn, reduces your tax bill. There are <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/tax-relief\/capital-allowances\/different-types-of-capital-allowances-127089.html\" rel=\"noopener\" target=\"_blank\">different types of capital allowances<\/a> available which have their own limits, thresholds, and criteria (just to make things more confusing).<\/p>\n<h3>Are you as tax efficient as possible?<\/h3>\n<p>As well as claiming tax relief on your expenses there might be other steps you can take to help your business be more tax efficient, and save money.<\/p>\n<h4>Would changing your business structure be more tax efficient?<\/h4>\n<p>One of the first decisions every business owner makes is about <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/should-i-register-myself-as-a-sole-trader-or-a-limited-company-45326.html\" rel=\"noopener\" target=\"_blank\">what structure to use when they set up<\/a>. Everyone’s a bit different, so your ultimate decision depends on you, but as your business changes over time you might find it useful to change how you operate.<\/p>\n<p>For some people, this means making the move from working as a sole trader to <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\" rel=\"noopener\" target=\"_blank\">incorporating a limited company<\/a> in order to be more tax efficient once the business starts making money. This is because the way you pay yourself from a limited company is different to how a sole trader takes an income.<\/p>\n<p>It can be a bit confusing, so <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/paying-yourself-through-your-business\" rel=\"noopener\" target=\"_blank\">check out our guide for more information<\/a>, or chat to the team on 020 3355 4047.<\/p>\n<h4>Would voluntarily registering for VAT help?<\/h4>\n<p>Businesses normally only need to <a href=\"https:\/\/www.theaccountancy.co.uk\/vat\/vat-registration\/how-do-i-register-for-vat-our-guide-to-vat-registration-93406.html\" rel=\"noopener\" target=\"_blank\">register for VAT once their taxable turnover reaches the registration threshold<\/a>, but in some cases early registration can be useful. This is because a VAT registered business can re-claim the VAT it pays on purchases, as well as paying the VAT it collects to HMRC.<\/p>\n<p>So, if the business regularly pays more VAT than it would collect on sales, registering for VAT will allow the business to reclaim the difference!<\/p>\n<div class=\"blogbox\">Our article about <a href=\"https:\/\/www.theaccountancy.co.uk\/vat\/vat-registration\/should-i-voluntarily-register-for-vat-early-14770.html\" rel=\"noopener\" target=\"_blank\">Voluntary VAT Registration<\/a> explains it in more detail.<\/div>\n<p>&nbsp;<br \/>\n<em>Learn more about our online accounting services to help small businesses and sole traders. Call the team for a chat on 020 3355 4047, or <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>As the cost-of-living crisis grinds on, small businesses and sole traders are once again battling through tough times. Add to that an&#8230;<\/p>\n","protected":false},"author":14,"featured_media":160706,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[564,868,862,870,531,533,21,28,24,36,585,800],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"As the cost-of-living crisis grinds on, small businesses and sole traders are once again battling through tough times. Add to that an...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-17T14:00:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-14T08:34:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1400\" \/>\n\t<meta property=\"og:image:height\" content=\"648\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elizabeth Hughes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elizabeth Hughes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\"},\"author\":{\"name\":\"Elizabeth Hughes\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\"},\"headline\":\"The Cost-of-Living Crisis Survival Guide for Small Businesses\",\"datePublished\":\"2022-10-17T14:00:41+00:00\",\"dateModified\":\"2024-06-14T08:34:49+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\"},\"wordCount\":1993,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png\",\"articleSection\":[\"Accountancy FAQs\",\"Budget Updates\",\"Capital Allowances\",\"Cost of Living and Business\",\"Fundraising and Finance\",\"Marketing\",\"Self Employed\",\"Small Business\",\"Sole Trader\",\"Tax\",\"Tax Relief\",\"VAT Registration\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\",\"name\":\"The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png\",\"datePublished\":\"2022-10-17T14:00:41+00:00\",\"dateModified\":\"2024-06-14T08:34:49+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png\",\"width\":1400,\"height\":648},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\",\"name\":\"Elizabeth Hughes\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"caption\":\"Elizabeth Hughes\"},\"description\":\"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html","og_locale":"en_GB","og_type":"article","og_title":"The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership","og_description":"As the cost-of-living crisis grinds on, small businesses and sole traders are once again battling through tough times. Add to that an...","og_url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2022-10-17T14:00:41+00:00","article_modified_time":"2024-06-14T08:34:49+00:00","og_image":[{"width":1400,"height":648,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png","type":"image\/png"}],"author":"Elizabeth Hughes","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Elizabeth Hughes","Estimated reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html"},"author":{"name":"Elizabeth Hughes","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362"},"headline":"The Cost-of-Living Crisis Survival Guide for Small Businesses","datePublished":"2022-10-17T14:00:41+00:00","dateModified":"2024-06-14T08:34:49+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html"},"wordCount":1993,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png","articleSection":["Accountancy FAQs","Budget Updates","Capital Allowances","Cost of Living and Business","Fundraising and Finance","Marketing","Self Employed","Small Business","Sole Trader","Tax","Tax Relief","VAT Registration"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html","url":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html","name":"The Cost-of-Living Crisis Survival Guide for Small Businesses | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png","datePublished":"2022-10-17T14:00:41+00:00","dateModified":"2024-06-14T08:34:49+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/resource_company_type\/self_employed\/the-cost-of-living-crisis-survival-guide-for-small-businesses-160692.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2022\/10\/The-Cost-of-Business-Survival-Guide.png","width":1400,"height":648},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362","name":"Elizabeth Hughes","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","caption":"Elizabeth Hughes"},"description":"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/160692"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=160692"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/160692\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/160706"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=160692"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=160692"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=160692"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}