{"id":60721,"date":"2023-11-20T10:00:05","date_gmt":"2023-11-20T10:00:05","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=60721"},"modified":"2024-06-14T14:36:57","modified_gmt":"2024-06-14T13:36:57","slug":"how-to-register-as-a-limited-company-in-the-uk","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html","title":{"rendered":"How to Incorporate a Registered Limited Company in the UK"},"content":{"rendered":"<p>Setting up a limited company isn&#8217;t the only way to <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/which-legal-structure-should-i-choose-when-i-start-a-business-14385.html\" rel=\"noopener\" target=\"_blank\">start a business<\/a>, and although it can sometimes be the most tax efficient way to register a business, the idea of it can seem a bit daunting. Fortunately, the incorporation process is actually fairly straightforward once you know what your responsibilities are. <\/p>\n<p>To start you off, we explain the steps involved in incorporating a limited company in the UK, and answer some of your most frequently asked questions.<\/p>\n<h3>What is a limited company?<\/h3>\n<p>A limited company is a type of business which is legally separate to the people who own and run it. This limits the extent to which you can be personally liable for any debts or issues the company faces.<\/p>\n<h4>Why register as a limited company?<\/h4>\n<p>Like all business decisions there are pros and cons to registering as a limited company, depending on your circumstances. <\/p>\n<p>For instance, setting up a company to run your business limits your personal liability, helping to protect any assets you own personally. It can also give you more tax efficient options for choosing how you pay yourself from the business.<\/p>\n<div class=\"blogbox\">Learn more about the <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/the-advantages-and-disadvantages-of-operating-as-a-limited-company-14752.html\" rel=\"noopener\" target=\"_blank\">potential advantages and disadvantages of running a limited company<\/a>.<\/div>\n<h3>What type of limited company should I set up?<\/h3>\n<p>There are <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/what-are-the-different-types-of-uk-limited-company-46179.html\" rel=\"noopener\" target=\"_blank\">different types of company structure to choose from<\/a>, but if you want to register a limited company there are two main choices:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Private limited company (LTDs)<\/li>\n<li>Public limited company (PLCs)<\/li>\n<\/ul>\n<p>Most small businesses and start-ups will form a private limited company because you don’t need to have a minimum amount of share capital. PLCs require a minimum share capital of £50,000, along with two shareholders, two directors and <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/company-secretary-responsibilities-3792.html\" rel=\"noopener\" target=\"_blank\">a company secretary<\/a>.<\/p>\n<p>We have a separate article which explains <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/the-difference-between-private-and-public-limited-companies-14800.html\" rel=\"noopener\" target=\"_blank\">the differences between public and private limited companies<\/a> in more detail.<br \/>\n&nbsp;<\/p>\n<p><a href=\"\/limited-company-formations\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Limited company registration service<\/h3>\n<p>We will incorporate your company free of charge!<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>What can I call my company?<\/h3>\n<p>Choosing a name is an exciting part of starting a new business, but beware – this can be a frustrating process!<\/p>\n<p>Trying to find a business name that hasn’t already been snapped up by someone else can be very difficult. The same goes for buying a domain name, when it can feel a bit like all the good ideas have already been taken.<\/p>\n<p>The good news is that you can <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/what-is-the-difference-between-a-company-name-and-a-trading-name-162426.html\" rel=\"noopener\" target=\"_blank\">use a different name to trade under and for marketing purposes<\/a>, as long as you make your company registration details very clear.<\/p>\n<h4>Are there rules for naming a company?<\/h4>\n<p>To make things even more complicated, there are restrictions on the type of name you can use to register your limited company. The name must:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>End with ‘Limited’ or ‘Ltd’ (or the Welsh equivalents ‘Cyfyngedig’ or ‘Cyf’)<\/li>\n<li>Be unique, and <a href=\"https:\/\/www.gov.uk\/limited-company-formation\/choose-company-name\" rel=\"noopener\" target=\"_blank\">not use special characters or punctuation<\/a> to create a name which is otherwise similar to one already registered<\/li>\n<li>Not be offensive or use sensitive words or expressions<\/li>\n<li>Not suggest any sort of official accreditation or connection to the government unless you have permission<\/li>\n<\/ul>\n<p>If you plan on trading overseas at any point, it might also be worth checking that your business name can cross the border without causing any offense in a different language and culture!<\/p>\n<h3>Where should I register my limited company?<\/h3>\n<p>To set up your limited company you’ll need to register it at Companies House. You can <a href=\"https:\/\/www.gov.uk\/limited-company-formation\/register-your-company?step-by-step-nav=37e4c035-b25c-4289-b85c-c6d36d11a763\" rel=\"noopener\" target=\"_blank\">do this yourself online<\/a>, by sending an IN01 form through the post, or by <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company-formations\" rel=\"noopener\" target=\"_blank\">using a company formations service such as your accountant<\/a>.<br \/>\n&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/sxF8btH_beg?si=MiQkjE4Wf1k4l-aH\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h4>Do I need to tell HMRC about my new company?<\/h4>\n<p>Companies House will normally take care of notifying HMRC, so you won’t need to contact them yourself unless you decide to register for Corporation Tax at a later date. Just make sure you register within 3 months of starting to trade!<\/p>\n<h4>Is there a different process for registering a limited company in Scotland?<\/h4>\n<p>The process for registering a limited company in Scotland is the same as it is to register a company in any other part of the UK. Just be aware that:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>If you incorporate a limited company in Scotland, it must have a Scottish address. You can’t use a registered office address in England, Wales, or Northern Ireland.<\/li>\n<li>Your Company Registration Number (CRN) will start with the letters SC, followed by 6 digits<\/li>\n<\/ul>\n<h3>What information do I need to register a limited company<\/h3>\n<p>You&#8217;ll need to supply Companies House with a few details in order to set up a new company, such as your personal information, and the details of anyone else involved in your business. Companies House will also need to know the location and nature of your company.<\/p>\n<h4>Personal information about yourself<\/h4>\n<p>As well as the usual request for your full name and address, you’ll need to provide more detailed info such as the town you were born in, your <a href=\"https:\/\/www.theaccountancy.co.uk\/national-insurance\/what-is-national-insurance-3855.html#do-i-need-a-national-insurance-number\" rel=\"noopener\" target=\"_blank\">National Insurance number<\/a>, and so on.<\/p>\n<h4>Verifying the identity of people in the company<\/h4>\n<p>Companies House have announced plans to introduce a new identity verification system to confirm <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/shareholders\/what-is-a-shareholder-of-a-company-3837.html\" rel=\"noopener\" target=\"_blank\">the identity of company shareholders<\/a> and directors. The system is not yet in place so you don&#8217;t need to do anything just yet. <\/p>\n<p>Once the new rules are active, it&#8217;s anticipated that you&#8217;ll need to provide identity documents such as a passport either directly to Companies House, or <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/authorising-an-agent-to-help-you-with-hmrc-181768.html\" rel=\"noopener\" target=\"_blank\">via an authorised agent (such as your accountant)<\/a>.<\/p>\n<h4>The nature of business – SIC code<\/h4>\n<p>Known as a <a href=\"https:\/\/www.gov.uk\/government\/publications\/standard-industrial-classification-of-economic-activities-sic?step-by-step-nav=37e4c035-b25c-4289-b85c-c6d36d11a763\" rel=\"noopener\" target=\"_blank\">Standard Industry Classification (SIC) code<\/a>, this describes the nature of your company’s business. For instance, an architect setting up a limited company would most likely use the SIC code 71111 &#8211; Architectural activities.<\/p>\n<h4>Making a statement of lawful purpose<\/h4>\n<p>The &#8216;subscribers&#8217; (the original shareholders of the new limited company) must confirm that the company is being formed for lawful purposes.<\/p>\n<h4>Registered office address<\/h4>\n<p>You must provide an address when you register your company – you’re not allowed to register without one. If your company has a physical location, you can use this as long as it is a full UK address. <\/p>\n<p>You’ll need to be able to access the location easily (or at least use a service which will manage your post for you), so don’t send it to offices at the other end of the country if you’re not able to get important documents sent on. Learn more about <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/changing-the-registered-office-address-for-your-limited-company-what-is-an-ad01-form-3758.html#can-i-use-any-address-as-my-registered-office-address\" rel=\"noopener\" target=\"_blank\">the rules around using a registered office address for your limited company<\/a> in our blog.<\/p>\n<h4>Choose your company directors<\/h4>\n<p>The directors are the people (or person) responsible for running the company and <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/directors\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\" rel=\"noopener\" target=\"_blank\">taking care of any compliance duties<\/a>, such as the Company Tax Return. You’ll need to provide the names and addresses of each director you appoint.<\/p>\n<p>You&#8217;ll need at least one director to form a private company, but you&#8217;ll need a minimum of two directors if you&#8217;re setting up a public limited company. If you do have more than one director, you might decide to <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/directors\/can-a-company-have-two-managing-directors-14737.html\" rel=\"noopener\" target=\"_blank\">make one of them the Managing Director<\/a>, although this title has more to do with your own internal reporting structure than a legal one.<\/p>\n<h4>Identify shareholders<\/h4>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/whats-the-difference-between-a-shareholder-and-a-director-40226.html\" rel=\"noopener\" target=\"_blank\">Shareholders are a bit different to directors<\/a>, although they can be the same people. Whereas a director is responsible for running the company, a shareholder is the person who owns it – literally holding a share.<\/p>\n<h4>Documents which show how you will run your company<\/h4>\n<p>You’ll also need to prepare:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>A Memorandum of Association (an agreement between the shareholders agreeing to form the company)<\/li>\n<li><a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/what-are-model-articles-of-association-in-a-limited-company-196848.html\" rel=\"noopener\" target=\"_blank\">Articles of Association<\/a> (written rules which explain director’s powers, and what shareholders are entitled to. You can use a standard format for this, known as ‘model articles’).<\/li>\n<\/ul>\n<h3>Company incorporation FAQs<\/h3>\n<p>We answer some of the most frequently asked questions we get about forming your own limited company.<\/p>\n<h4>Do I have to live in the UK to register a company here?<\/h4>\n<p>A director of a UK company can live anywhere in the world! You don’t have to be a UK resident in order to set up shop here, but you will need a UK registered address.<\/p>\n<h4>Do I need other directors to form a private limited company?<\/h4>\n<p>The answer to this depends on whether you’re setting up a private limited company or a public one. If you decide to set up a private limited company, you can do it by yourself without other directors (or shareholders). <\/p>\n<p>Setting up a public limited company is a bit different. You’ll need to have <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/difference-between-director-and-secretary-3796.html\" rel=\"noopener\" target=\"_blank\">a qualified secretary and at least two directors<\/a>, who must all be different people.<\/p>\n<h4>Who can be a limited company director?<\/h4>\n<p>A company director can be an individual, or another corporate entity such as a partnership or even another limited company. <\/p>\n<p>Every company must have at least one director who is a ‘natural person’. This means they’re a real-life human individual, rather than another corporate entity or organisation. <\/p>\n<p>Directors should also be older than 16, and not be disqualified from being a director, or bankrupt (or in the process of being declared so).  <\/p>\n<div style=\"text-align: center;\"><img loading=\"lazy\" decoding=\"async\" class=\"alignnone lazyload\" style=\"--smush-placeholder-width: 520px; --smush-placeholder-aspect-ratio: 520\/1059;border: 0px; width: 100%; height: auto; max-width: 520px;\" title=\"Can I be a Sole Director?\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/10\/Can-I-be-a-Sole-Director-2.svg\" alt=\"Can I be a Sole Director?\" width=\"520\" height=\"1059\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" \/><\/div>\n<h4>When should you register as a limited company?<\/h4>\n<p>You might decide to operate as a sole trader before making the move to incorporation, and this is entirely up to you. Some business owners find it more tax efficient to start out this way, and then register the company at a later date.<\/p>\n<p>From a compliance point of view, if you plan to register a limited company then you must do so within 3 months of starting to do business. <\/p>\n<h4>Can I form my limited company myself or should I use an agent?<\/h4>\n<p>You can register your limited company yourself online or using a postal IN01 form, or you can ask a formations agent to complete the incorporation process on your behalf. Your existing solicitor or <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company-formations\" rel=\"noopener\" target=\"_blank\">accountant might offer a formations service<\/a>, or you can research agencies which offer a standalone service.<\/p>\n<h4>How much does it cost to register a company?<\/h4>\n<p>It costs £12 to register a company online, and you can pay for it using a credit or debit card, or through your PayPal account. Registering by post (which is a requirement if you decide not to use ‘limited’ in your company name) costs £40, which is payable by cheque. A formations agent might charge you extra to cover the cost of their services.<\/p>\n<h4>How long does it take to register a limited company<\/h4>\n<p>Once you submit your incorporation request the company will usually be registered within 24 hours. It might take a bit longer to receive your registration details, depending on whether you requested online or postal notifications. <\/p>\n<h4>How do I register a limited company as dormant?<\/h4>\n<p>It’s not unheard of to <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/dormant-company\/dormant-companies-explained-8202.html\" rel=\"noopener\" target=\"_blank\">register a limited company only to leave it dormant<\/a>, and there are lots of reasons why this might be useful for you. For instance, if you want to protect a brand name or trademark, or you want to use it to hold assets or <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/protecting-your-business-name-intellectual-property-and-trademarks-53379.html\" rel=\"noopener\" target=\"_blank\">intellectual property<\/a>. You can tell HMRC and Companies House that you plan to keep your new company dormant during the registration process.<br \/>\n&nbsp;<\/p>\n<p><a href=\"\/who-we-help\/limited-company-accountants\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Limited company accountancy services<\/h3>\n<p>From only £54.50 per month<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>What happens after I register a limited company?<\/h3>\n<p>You’ve set up your brand-new limited company – great! Now what? <\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Companies House will issue a Certificate of Incorporation to confirm the successful registration of your new company. You’ll need to display your address and Company Registration Number (CRN) on your invoices, website, stationery… pretty much everywhere.<\/li>\n<li>If you registered for Corporation Tax when you set up the company, you’ll receive your company’s <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/where-can-i-find-my-unique-taxpayer-reference-utr-number-1403.html\" rel=\"noopener\" target=\"_blank\">Unique Taxpayer Reference (UTR) number<\/a> from HMRC.<\/li>\n<li>Send your <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/company-tax-returns-and-corporation-tax-3746.html\" rel=\"noopener\" target=\"_blank\">Company Tax Return and pay Corporation Tax.<\/a><\/li>\n<li>You’ll need to submit annual accounts to Companies House each year, and this information will be made available on the public register. Read our guide to <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/obligations-and-deadlines-for-limited-companies\" rel=\"noopener\" target=\"_blank\">obligations and deadlines for limited companies<\/a>.<\/li>\n<li>If you plan to take a salary from the business, or to employ someone else, you’ll need to register for PAYE and set up payroll. Learn more about <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/whats-the-most-tax-efficient-directors-salary-in-2022_23-51622.html\" rel=\"noopener\" target=\"_blank\">taking a tax-efficient director’s salary from your limited company<\/a>.<\/li>\n<li>Set up robust bookkeeping processes! It’s a compliance requirement, but <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">good bookkeeping is also incredibly useful<\/a> when it comes to running a successful business.<\/li>\n<li>Open a business bank account – it’s a requirement for limited companies<\/li>\n<li>Consider hiring an accountant if you don’t already have one. They’ll be able to help you manage your deadlines, save money, and claim any tax relief you’re entitled to. They might even be able to <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company-formations\" rel=\"noopener\" target=\"_blank\">help you register the company<\/a>!<\/li>\n<p>&nbsp;<br \/>\n<em>Learn more about our <a href=\"https:\/\/www.theaccountancy.co.uk\/who-we-help\/limited-company-accountants\" rel=\"noopener\" target=\"_blank\">online accounting services for limited companies and directors<\/a>. Call the team on 020 3355 4047, and <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Setting up a limited company isn&#8217;t the only way to start a business, and although it can sometimes be the most tax&#8230;<\/p>\n","protected":false},"author":14,"featured_media":185182,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[564,558,821,560],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Setting up a limited company isn&#8217;t the only way to start a business, and although it can sometimes be the most tax...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2023-11-20T10:00:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-14T13:36:57+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elizabeth Hughes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elizabeth Hughes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\"},\"author\":{\"name\":\"Elizabeth Hughes\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\"},\"headline\":\"How to Incorporate a Registered Limited Company in the UK\",\"datePublished\":\"2023-11-20T10:00:05+00:00\",\"dateModified\":\"2024-06-14T13:36:57+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\"},\"wordCount\":2133,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png\",\"articleSection\":[\"Accountancy FAQs\",\"Business Start Ups\",\"Incorporation\",\"Limited Company\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\",\"name\":\"How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png\",\"datePublished\":\"2023-11-20T10:00:05+00:00\",\"dateModified\":\"2024-06-14T13:36:57+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png\",\"width\":1600,\"height\":740},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\",\"name\":\"Elizabeth Hughes\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"caption\":\"Elizabeth Hughes\"},\"description\":\"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html","og_locale":"en_GB","og_type":"article","og_title":"How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership","og_description":"Setting up a limited company isn&#8217;t the only way to start a business, and although it can sometimes be the most tax...","og_url":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2023-11-20T10:00:05+00:00","article_modified_time":"2024-06-14T13:36:57+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png","type":"image\/png"}],"author":"Elizabeth Hughes","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Elizabeth Hughes","Estimated reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html"},"author":{"name":"Elizabeth Hughes","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362"},"headline":"How to Incorporate a Registered Limited Company in the UK","datePublished":"2023-11-20T10:00:05+00:00","dateModified":"2024-06-14T13:36:57+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html"},"wordCount":2133,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png","articleSection":["Accountancy FAQs","Business Start Ups","Incorporation","Limited Company"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html","url":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html","name":"How to Incorporate a Registered Limited Company in the UK | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png","datePublished":"2023-11-20T10:00:05+00:00","dateModified":"2024-06-14T13:36:57+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/03\/How-to-Register-as-a-Limited-Company-in-the-UK-1.png","width":1600,"height":740},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362","name":"Elizabeth Hughes","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","caption":"Elizabeth Hughes"},"description":"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/60721"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=60721"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/60721\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/185182"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=60721"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=60721"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=60721"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}