{"id":69966,"date":"2020-12-04T10:00:38","date_gmt":"2020-12-04T10:00:38","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=69966"},"modified":"2024-04-05T14:40:30","modified_gmt":"2024-04-05T13:40:30","slug":"part-two-the-heroes-running-businesses-through-covid-19","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html","title":{"rendered":"Part Four &#8211; Introducing the Heroes Running Businesses Through COVID-19"},"content":{"rendered":"<p>We know that there&#8217;s never an easy way or a good time to start up a new business. There are always challenges, but this year has been particularly tough for <a href=\"https:\/\/www.theaccountancy.co.uk\/who-we-help\/startup-business-accountants\" target=\"_blank\" rel=\"noopener noreferrer\">new startups<\/a>.<\/p>\n<p>The global reach of the coronavirus pandemic has brought economic uncertainty to many. It&#8217;s far from being a nurturing environment for a startup business, and yet the number of company formations is climbing. We think that&#8217;s something to celebrate!<\/p>\n<p>When we prepared our first article <a href=\"https:\/\/www.theaccountancy.co.uk\/business-support-for-covid-19\/introducing-the-heroes-running-businesses-through-covid-19-68762.html\" target=\"_blank\" rel=\"noopener noreferrer\">Introducing the Heroes Running Businesses Through COVID-19<\/a>, the responses were inspiring. The feedback is thought-provoking, motivational, and humbling.<\/p>\n<p>So, here&#8217;s Part Four of our Start Up Heroes!<\/p>\n<h3>Matt Godfrey<\/h3>\n<p><a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.godfreydesigns.co.uk\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Godfrey Designs<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.facebook.com\/DesignbyGodfrey\/\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a><\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" style=\"--smush-placeholder-width: 1200px; --smush-placeholder-aspect-ratio: 1200\/628;border: 0px; width: 100%; height: auto; max-width: 1200px; border-radius: 30px;\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/10\/Matt-Godfrey-1.png\" alt=\"Matt Godfrey\" width=\"1200\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" class=\"lazyload\" \/><\/div>\n<p>I am the sole director of Godfrey Designs, a new business that I set up after graduating from the University of Surrey. I develop websites and bespoke software applications which allow individuals and businesses to conduct their business online, and reach a wider community.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;During my last term of University, the UK went into strict lockdown.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>With COVID, power outages, and University restrictions, finishing my degree was a challenge. But, sitting in my halls of residence, I thought a lot about the businesses facing hardship. Reports about local and national economic damage were a constant feature on the news.<\/p>\n<p>Immediately after graduating, I set up Godfrey Designs so I could use my skills to help businesses or individuals who have been financially hit during the pandemic.<\/p>\n<p>One of my first clients was a café in Hampshire called Tanya’s Kitchen. They first opened their doors in February, but were forced to close when lockdown hit shortly after.<\/p>\n<p>This was an incredibly difficult time for their new business and they did not have a functioning website to create an online presence for their store.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;I approached them to offer my services, so they could reach out to the wider community.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>I set about creating a mobile-friendly website to promote their café, offering homemade cakes and afternoon tea.<\/p>\n<p>For another client I developed an online calculator for cushion foam. Users can enter specific measurements, select upgrade options, and purchase their products online.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;Having no prior real-life business experience, creating a business for the first time was a very daunting prospect.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>I spent a lot of time researching how to run a successful business to prepare myself. There is a wealth of information out there, which easily becomes overwhelming.<\/p>\n<p>The main challenge for me was understanding the exact processes of setting up a business. Theory is one thing, but putting it into practice is another.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;Being cut off from other people, and having to communicate with clients solely over the phone makes the information gathering process more challenging.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>To build a software product, you need to ensure you ask the right questions and gather enough information. As there were no in-person meetings, it was harder to communicate ideas through my usual process of sketches and illustrations.<\/p>\n<p>The testing and development process also became increasingly difficult, as I could not easily demonstrate the website or software.<\/p>\n<p>Using Zoom and other programs to demonstrate work has its own limitations, such as streaming quality. It’s also dependent on the client&#8217;s technical ability to establish a connection with you.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;I had to deal with the stress of starting a new business in isolation.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>Business-related tasks continually increased day-by-day in a very lonely environment, and this had an effect on my concentration and motivation.<\/p>\n<p>To adapt my business, I created an online portal where clients can easily view their products online.<\/p>\n<p>Instead of screen sharing over Zoom, clients can securely log in to a testing portal, viewing and testing the product in their own time. It has been a great success.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;As a new start-up business, I quickly learnt the importance of value for money and ensuring overheads are as low as possible.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>I am committed to continuing to help those struggling in this global outbreak, and believe a &#8216;success story’ should not be about financial success. For me, it&#8217;s more about providing opportunities and success for others.<\/p>\n<p>I aim to provide a professional service for very little cost in comparison to other, more established, developers on the market. This way I can provide businesses with tools that enable them to adapt to the changing world.<\/p>\n<p>My main motivation is the positive feedback I receive and knowing that I have, in my own way, helped an independent business to succeed.<\/p>\n<p>&nbsp;<\/p>\n<hr \/>\n<h3>Mark Alexander Todd<\/h3>\n<p><a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.pocketpicturesltd.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Pocket Pictures Ltd<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/pocket-courses.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Pocket Courses<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.facebook.com\/pocketpicturesltd\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.instagram.com\/pocketpicturesltd\/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.linkedin.com\/in\/markalexandertodd\/\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a><\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" style=\"--smush-placeholder-width: 1200px; --smush-placeholder-aspect-ratio: 1200\/628;border: 0px; width: 100%; height: auto; max-width: 1200px; border-radius: 30px;\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/11\/Matt_Alexander_Todd.png\" alt=\"Mark Alexander Todd\" width=\"1200\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" class=\"lazyload\" \/><\/div>\n<p>Pocket Pictures is a film and video production company. I am the founder of the company, but my day to day role is as creative director and filmmaker.<\/p>\n<p>All of my working life, I have been involved in making videos, films or TV series. In the 1990’s I was a TV puppeteer on shows like Spitting Image, and films like The Muppet Christmas Carol.<\/p>\n<p>I was also involved in producing short films and directing commissioned BBC shows such as Digital Rebels.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;I have wandered away a couple of times, and started other businesses here and in the USA.&#8221;<\/h5>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\"><\/h5>\n<p>But I still come back to producing media because I understand and love it – it’s really what I was born to do.<\/p>\n<p>Finding a suitable working space is always a challenge. A studio is not an office, it falls somewhere in between an office and a light industrial unit.<\/p>\n<p>Luckily, Birmingham has many renovated factory spaces, so when we were contacted by MIA we jumped at the unit in The Telsen Centre.<\/p>\n<p>It provides us with good flexible ‘studio space’, and they don’t mind if we attach video lights to the ceiling!<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;For obvious reasons, this year we have had to reinvent ourselves in some ways.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>Our in-house media training is now online and we launched our own training platform, <a href=\"https:\/\/pocket-courses.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">pocket-courses.com<\/a>. Now we create training packages for other companies in the same situation.<\/p>\n<p>We also have <a href=\"https:\/\/pocket-courses.com\/courses\/successful-selftapes-2021\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">online courses to help actors create and produce their own professional selftapes<\/a>. It’s great to see how businesses have been quick to explore new ways they can evolve and interact with customers, in the absence of the usual client-facing option.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;Because of travelling restrictions we have produced a number of projects with shorter production periods, and sometimes even virtually.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>This included one project which we produced entirely via Zoom; a 7-part online comedy series called Isolation Nation for a comedian in Luton.<\/p>\n<p>I like to think of Pocket Pictures as a breathing company. When we have large contracts, we expand our freelance crew. On a day-to-day basis there are just two of us in the office – and the business work falls to me.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;I love the creative work I do, so I like to make my other ‘business work’ as simple and painless as possible.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>When I first approached The Accountancy Partnership, I was looking for a simpler way to handle my accounts in light of the change to Making Tax Digital.<\/p>\n<p>I also like the business model of monthly payments, rather than one huge bill at year end. Plus, I’d struggled with working KashFlow and in contrast, their <a href=\"https:\/\/www.theaccountancy.co.uk\/free-bookkeeping-software\" target=\"_blank\" rel=\"noopener noreferrer\">Pandle software<\/a> is much more ‘me’ friendly.<\/p>\n<p>I can honestly say TAP has helped me dramatically reduce the time I spend on accounts and invoicing. Add this to the fact that my accountancy costs have been reduced by 58%, and I am a very happy business owner, in a less than happy time.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;2021 will see us working with more companies to create online training, so we will add to our eclectic portfolio of training packages.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>We’re also looking at how we can help companies get seen in the new post-COVID landscape.<\/p>\n<p>This is not a time for us, or any other company, to settle back on our laurels and say “come find us” to potential clients.<\/p>\n<p>If we’re not out there banging a drum, tooting our own horn, or any other orchestral metaphor you can think of, then we’ll get lost in the crowd.<\/p>\n<p>So, thank you TAP for giving Pocket Pictures some extra time to create, not administrate!<\/p>\n<hr \/>\n<h3>Gemma Thompson<\/h3>\n<p><a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/diveproof.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Dive Proof<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.facebook.com\/diveproof\" target=\"_blank\" rel=\"noopener noreferrer\">Facebook<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.instagram.com\/diveproof\/\" target=\"_blank\" rel=\"noopener noreferrer\">Instagram<\/a><\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" style=\"--smush-placeholder-width: 1200px; --smush-placeholder-aspect-ratio: 1200\/628;border: 0px; width: 100%; height: auto; max-width: 1200px; border-radius: 30px;\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/11\/Gemma_Thompson.png\" alt=\"Gemma Thompson\" width=\"1200\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" class=\"lazyload\" \/><\/div>\n<p>Dive Proof is a specialist company offering custom waterproof log books and stationery. Grease proof, wipe-able, chemically resistant and environmentally friendly, these books can be written on using a normal ball point pen or pencil, and cannot be torn.<\/p>\n<p>Individual books can be personalised with names and photographs. We can also create completely bespoke items for dive schools and retailers.<\/p>\n<p>Hand made in the UK and designed by pros, these books are for those who work and play in all elements. Most importantly, they can withstand an evening on a pub table.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;I spent the first half of my twenties as a scuba diving instructor, working in Malaysia.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>After that I was in Cyprus working as a scuba instructor training the military.<\/p>\n<p>Being outdoors, in and out of the ocean all day with lots of wet gear lying around, makes it difficult to keep documents and log books dry.<\/p>\n<p>The soggy log book seemed to be a common problem for my students and customers. I regularly had to hand out new log books and help people copy details over into a new one.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;There didn’t really seem to be an obvious or easy solution to this problem, so Dive Proof was born.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>The first decision I had to make was &#8216;how do I get these books made?&#8217; I taught myself to use Illustrator so did all the design work.<\/p>\n<p>The next step was looking at printing them in China, but then I might be stuck with thousands of them that I couldn’t sell.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;It seemed a less risky option to print the books myself, so that was another new skill; printing, cutting and binding books.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>I’m very glad I went down this route as my designs have evolved a lot in the last 3 years. It means I&#8217;m able to offer customised books for every customer – something that is now our USP!<\/p>\n<p>It also means we can work with retailers, adding their logo or branding for resale, or take on completely bespoke projects.<\/p>\n<p>We produce Nato Sequence of Order notebooks for Officer Cadets at Britannia Naval College, and Search and Rescue log books for the Scottish Ambulance Service.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;The first lockdown period, from March to May 2020, saw our sales drop to about 10-15% of what they were in previous months.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>Luckily our overheads are relatively low, so we could still just about cover these and didn’t end up at a loss. With diving not allowed in many countries, including the UK, there was just no demand for our product at all.<\/p>\n<p>Fortunately our business bounced back straight away. June and July sales were comparable to the same time last year – I’m still not sure how we managed that!<\/p>\n<p>Lockdown has taught us that it’s good to have a finger in many pies, and not rely solely on one industry or source of income.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;We have some expansion plans in the pipeline so we can diversify to new markets.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>I signed up with TAP due to how affordable they are. It was an easy monthly payment and I know exactly what I was getting for my money.  The reason I stay (and recommend them to everyone who will listen), is because of how quick they are.<\/p>\n<p>I am a really impatient person. If I am 4 hours deep into some bookwork and need an answer desperately, I know they will get back to me really quickly. It’s something I really appreciate!!<\/p>\n<p>We are hoping to launch a sister company which still specialises in waterproof printing, but will be trading under a more generic name.<\/p>\n<p>While mainly concentrating on B2B sales to provide clients with waterproof printing, we are hoping to also be a place for budding authors to self publish. For example, wipe clean cook books!<\/p>\n<hr \/>\n<h3>Claire Verney<\/h3>\n<p><a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.dvact.org\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">DV-ACT Ltd<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/twitter.com\/dv_act\" target=\"_blank\" rel=\"noopener noreferrer\">Twitter<\/a> | <a style=\"color: #2d74aa; padding-top: 2rem; font-size: 1.05rem; font-weight: bold; font-family: 'Muli',sans-serif; text-decoration: none;\" href=\"https:\/\/www.linkedin.com\/company\/dv-act-ltd\" target=\"_blank\" rel=\"noopener noreferrer\">LinkedIn<\/a><\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" style=\"--smush-placeholder-width: 1200px; --smush-placeholder-aspect-ratio: 1200\/628;border: 0px; width: 100%; height: auto; max-width: 1200px; border-radius: 30px;\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/11\/Claire_Verney.png\" alt=\"Claire Verney\" width=\"1200\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" class=\"lazyload\" \/><\/div>\n<p>I am the director and practice manager at DV-ACT. We provide expert domestic abuse assessments, consultancy and training to local authorities and the courts.<\/p>\n<p>When the charity I worked for was taken over, our team wanted to carry on delivering our vital services. We set up our own business to continue offering our services across the UK.<\/p>\n<p>Having no knowledge or experience of setting up a business, we needed help with finance, marketing and GDPR.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;All of our services included meeting with clients face to face so we were initially concerned. We quickly switched to providing online Zoom appointments.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>When China went in to lockdown I saw that it wouldn’t be long before we were in the same position. I was very concerned for those families living with abusers in lockdown.<\/p>\n<p>We put together guidance to help those working with vulnerable families with safety planning. It drew hundreds of professionals to our site.<\/p>\n<p>Our expertise helps to guide professionals and the general public on how to support those living with abusers.<\/p>\n<p>We then began offering online video appointments using Zoom, feeling it was important that we kept working through lockdown.<\/p>\n<h5 style=\"margin: auto; max-width: 600px; text-align: center;\">&#8220;Keeping children safe from abuse must never stop.&#8221;<\/h5>\n<p>&nbsp;<\/p>\n<p>We plan to expand the treatment work we do with parents, so that programmes of work can be completed online. We are hiring additional staff to complete the work and, as soon as we have time, we will launch the new service.<\/p>\n<hr \/>\n<p>&nbsp;<\/p>\n<p><em>Learn more about the <a href=\"https:\/\/www.theaccountancy.co.uk\/services\" target=\"_blank\" rel=\"noopener noreferrer\">online accounting services<\/a> we provide to our hero clients. Call 020 3355 4047 to talk to one of the team, or <a href=\"https:\/\/www.theaccountancy.co.uk\/callback-request\">request a free call back<\/a>. <\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>We know that there&#8217;s never an easy way or a good time to start up a new business. There are always challenges,&#8230;<\/p>\n","protected":false},"author":14,"featured_media":71937,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[558,521],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"We know that there&#8217;s never an easy way or a good time to start up a new business. There are always challenges,...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-04T10:00:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-05T13:40:30+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elizabeth Hughes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elizabeth Hughes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\"},\"author\":{\"name\":\"Elizabeth Hughes\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\"},\"headline\":\"Part Four &#8211; Introducing the Heroes Running Businesses Through COVID-19\",\"datePublished\":\"2020-12-04T10:00:38+00:00\",\"dateModified\":\"2024-04-05T13:40:30+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\"},\"wordCount\":2289,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png\",\"articleSection\":[\"Business Start Ups\",\"Client of the Month\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\",\"name\":\"Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png\",\"datePublished\":\"2020-12-04T10:00:38+00:00\",\"dateModified\":\"2024-04-05T13:40:30+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png\",\"width\":1600,\"height\":740,\"caption\":\"Client Success Stories - Part 4\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\",\"name\":\"Elizabeth Hughes\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"caption\":\"Elizabeth Hughes\"},\"description\":\"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html","og_locale":"en_GB","og_type":"article","og_title":"Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership","og_description":"We know that there&#8217;s never an easy way or a good time to start up a new business. There are always challenges,...","og_url":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2020-12-04T10:00:38+00:00","article_modified_time":"2024-04-05T13:40:30+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png","type":"image\/png"}],"author":"Elizabeth Hughes","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Elizabeth Hughes","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html"},"author":{"name":"Elizabeth Hughes","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362"},"headline":"Part Four &#8211; Introducing the Heroes Running Businesses Through COVID-19","datePublished":"2020-12-04T10:00:38+00:00","dateModified":"2024-04-05T13:40:30+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html"},"wordCount":2289,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png","articleSection":["Business Start Ups","Client of the Month"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html","url":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html","name":"Part Four - Introducing the Heroes Running Businesses Through COVID-19 | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png","datePublished":"2020-12-04T10:00:38+00:00","dateModified":"2024-04-05T13:40:30+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/part-two-the-heroes-running-businesses-through-covid-19-69966.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/12\/Client-Success-Stories-Part-4.png","width":1600,"height":740,"caption":"Client Success Stories - Part 4"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362","name":"Elizabeth Hughes","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","caption":"Elizabeth Hughes"},"description":"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/69966"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=69966"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/69966\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/71937"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=69966"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=69966"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=69966"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}