{"id":74629,"date":"2023-08-18T10:00:12","date_gmt":"2023-08-18T09:00:12","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=74629"},"modified":"2024-06-13T15:29:04","modified_gmt":"2024-06-13T14:29:04","slug":"how-to-start-a-business-from-scratch","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html","title":{"rendered":"Top Tips on How to Start A Business"},"content":{"rendered":"<p>Starting your own business is a super exciting time but it can also be a little scary as you try to make sense of everything. In this article we take a look over what you need to do before launch day and beyond.<\/p>\n<h3>Why do you want to start your business?<\/h3>\n<p>Starting a business can mean more money and freedom but there’s a lot of work to put in first. We hate to say it, but at times you’ll need to make sacrifices and difficult decisions.<\/p>\n<p>If you know the logic behind it, it will help you stay motivated and, crucially, having clear goals will help you plan how to achieve them more efficiently.<\/p>\n<p>So, ask yourself why you’re starting the business. Someone who <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/community-interest-companies\/accounting-for-not-for-profits-and-community-interest-companies-116137.html\" rel=\"noopener\" target=\"_blank\">starts a business to do good in the local community<\/a> will have a different approach to the person who wants to make enough to live on without working for someone else.<\/p>\n<h3>Which business structure is best?<\/h3>\n<p>Got a concept and name for your business? Great! To make things official you’ll now need to decide <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/which-legal-structure-should-i-choose-when-i-start-a-business-14385.html\" rel=\"noopener\" target=\"_blank\">what sort of legal structure you should use to register your business<\/a>. Don’t worry, this isn’t as daunting as it sounds, but it does need a bit of research. <\/p>\n<p>All business structures have their pros and cons depending on your circumstances, so it’s worth asking a specialist for advice if you’re not sure. The most common business structures in the UK are:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Sole trader<\/li>\n<li>Limited company<\/li>\n<li>Partnership<\/li>\n<li>Limited Liability Partnership (LLP)<\/li>\n<\/ul>\n<div class=\"examplebox\">\n<h4>A note on the trading allowance<\/h4>\n<p>Before you get as far as registering your business, it&#8217;s well worth us taking a moment to mention <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/tax-relief\/can-i-use-the-trading-allowance-57305.html\" rel=\"noopener\" target=\"_blank\"<a style=\"color: #3669A4; text-decoration: underline;\">the £1,000 trading allowance<\/a>. It enables you to earn up to £1,000 in a tax year from self-employment or property without needing to report this to HMRC or pay tax on the income, even if you also work for an employer.\n<\/div>\n<h4>Sole trader<\/h4>\n<p>Lots of low-risk start-ups register as sole traders because it’s the cheapest, quickest and simplest way to start a new business, and <a href=\"https:\/\/www.theaccountancy.co.uk\/soletrader\/does-a-sole-trader-need-to-register-with-companies-house-7654.html\" rel=\"noopener\" target=\"_blank\">you won&#8217;t need to be listed on Companies House<\/a>. It’s simply a case of registering with HMRC as soon as possible after you’ve started your business <a href=\"https:\/\/www.theaccountancy.co.uk\/self-assessment\/registering\/how-does-a-sole-trader-register-for-self-assessment-14776.html\" rel=\"noopener\" target=\"_blank\">so you’re set up for Self Assessment<\/a>.<\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" class=\"infographic1 lazyload\" style=\"--smush-placeholder-width: 340px; --smush-placeholder-aspect-ratio: 340\/451;margin: 2rem 1rem; max-width: 300px;\" title=\"If you earn less than the trading allowance\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/10\/Do_I_Need_to_Pay_Tax_on_My_Side-Hustle_Hobby_Business_.png\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" \/><img decoding=\"async\" class=\"infographic1 lazyload\" style=\"--smush-placeholder-width: 340px; --smush-placeholder-aspect-ratio: 340\/451;margin: 2rem 1rem; max-width: 300px;\" title=\"If you earn more than the trading allowance\" data-src=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2023\/10\/Do_I_Need_to_Pay_Tax_on_My_Side-Hustle_Hobby_Business_-1.png\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" \/><\/div>\n<h4>Limited company<\/h4>\n<p>The big benefit of <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\" rel=\"noopener\" target=\"_blank\">setting up as a limited company<\/a> is that you, as the owner, are only responsible for business debts up to the value of your shares. In other words, unlike a sole trader, your business and personal finances are separate, so if the company ends up in financial difficulties your personal assets aren’t at risk.<\/p>\n<p>Some people find that operating a limited company is more complex than being a sole trader as <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/directors\/what-responsibilities-do-directors-have-in-a-limited-company-13504.html\" rel=\"noopener\" target=\"_blank\">directors have certain responsibilities<\/a>. You’ll also need to submit full accounts and pay Corporation Tax each year, along with your own tax return to report any dividends you take.<\/p>\n<p>You might find our article <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/should-i-register-myself-as-a-sole-trader-or-a-limited-company-45326.html\" rel=\"noopener\" target=\"_blank\">Should I Register Myself as a Sole Trader or a Limited Company?<\/a> useful here.<\/p>\n<h4>Partnership<\/h4>\n<p>If you’re planning to run your business with someone else, you might consider <a href=\"https:\/\/www.theaccountancy.co.uk\/partnerships\/how-do-i-register-a-business-partnership-3840.html\" rel=\"noopener\" target=\"_blank\">setting up as a partnership<\/a>. You then share the responsibility and decision-making, so just be clear how profits will be shared. <\/p>\n<h4>Limited Liability Partnership (LLP)<\/h4>\n<p>This is basically a business partnership but combined with the safety net of having limited liability. Unlike general partnerships, <a href=\"https:\/\/www.theaccountancy.co.uk\/llp-limited-liability-partnership\/setting-up-and-running-an-llp-107283.html\" rel=\"noopener\" target=\"_blank\">setting up an LLP<\/a> creates a separate legal entity to its owners, so your personal assets have more protection from anything happening to the business. <\/p>\n<h3>What about if I buy a franchise?<\/h3>\n<p>Franchising allows one business to operate using the branding and processes of another business &#8211; usually in exchange for fees and royalty payments. It can mean that you&#8217;re launching a business using an established model which already works, but you&#8217;ll still need to register as a separate business.<\/p>\n<div class=\"blogbox\"><a href=\"https:\/\/www.theaccountancy.co.uk\/franchises\/should-i-buy-into-a-franchise-60707.html\" rel=\"noopener\" target=\"_blank\">Learn more about buying a franchise<\/a>.<\/div>\n<h3>Carry out market research<\/h3>\n<p>Researching your target audience first-hand is the best way to really understand what they want and need. It also gives you a much deeper understanding of your industry and your competitors. The results of regular market research will also help you make important business decisions around pricing and product development, helping you avoid costly mistakes (hopefully!).<\/p>\n<p>A good tip here is to ask as many different people as possible. Try to approach people you don’t know to reduce bias, asking them to physically test your product or service, if possible. Focus groups are a popular way of doing this, or you could send out an online survey. And of course, check out what your competitors are doing to see if there’s a gap in the market you can fill.<br \/>\n&nbsp;<\/p>\n<p><a href=\"\/who-we-help\/startup-business-accountants\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Startup accountancy services<\/h3>\n<p>From only <strike>£54.50<\/strike> £32.70 per month <\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>How will you fund your startup?<\/h3>\n<p>When it comes to <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-fund-your-start-up-106872.html\" rel=\"noopener\" target=\"_blank\">funding your startup business<\/a>, there are a huge range of options out there. The government currently offers several <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/funding-options-for-small-businesses-36678.html\" rel=\"noopener\" target=\"_blank\">small business loans and grants<\/a> (the <a href=\"https:\/\/www.gov.uk\/business-finance-support\" rel=\"noopener nofollow\" target=\"_blank\">Finance and Support section<\/a> of the Gov.uk website is a good place to start). It’s worth trying your local council too.<\/p>\n<div class=\"actionbox\">Loans need to be paid back, usually with interest, whereas grants are offered as a non-repayable lump sum.<\/div>\n<p>&nbsp;<br \/>\nYou might also decide to <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-can-i-make-my-bids-and-tender-proposals-stand-out-55247.html\" rel=\"noopener\" target=\"_blank\">pitch to an investor<\/a>, or <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/crowdfunding-and-tax-for-your-big-idea-136867.html\" rel=\"noopener\" target=\"_blank\">dabble in a bit of crowdfunding<\/a>. Again, you’ll need to do your homework and check your business plan is absolutely watertight. Whatever you do, make sure you can repay any loans and don’t end up in financial hot water that could sink you before you can swim.<\/p>\n<div class=\"blogbox\">Use our <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/pitch-deck-template\" rel=\"noopener\" target=\"_blank\">Pitch Deck Template<\/a> to prepare your presentation.<\/div>\n<h4>Starting a business with no money (or not much)<\/h4>\n<p>Starting a business can be an expensive process, though this does depend on what it is that you’re doing and some businesses deliberately strive for <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/how-do-i-grow-my-business-without-external-funding-15976.html\" rel=\"noopener\" target=\"_blank\">far lower start-up costs<\/a> than others need to.<\/p>\n<p>Whatever you’re starting, keeping costs down (without compromising quality) will help you reach that crucial <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/break-even-point-bep-40175.html\" rel=\"noopener\" target=\"_blank\">break-even point<\/a> and start turning a profit sooner. A few pointers we&#8217;ve picked up from our years of working with businesses include:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li><strong>Get your timing right:<\/strong> Launching your business at the best possible moment <em>can<\/em> help you save a lot of money. For example, you could spend all of your marketing budget advertising sunglasses in winter, or you could spend it in the summer when more people are likely to be more interested.<\/li>\n<li><strong>Choosing your workspace:<\/strong> Renting or buying space is often one of the biggest expenses that a start-up business faces. It’s also fairly common for it to be unnecessary &#8211; we’re here with the tough love! Unless it’s absolutely necessary to work from specific premises, can you save money by starting your business elsewhere, such as from home?<\/li>\n<li><strong>Buy used equipment:<\/strong> Yes, you can <a href=\"https:\/\/www.theaccountancy.co.uk\/expenses\/claiming-business-expenses-when-youre-self-employed-34478.html\" rel=\"noopener\" target=\"_blank\">claim tax relief on allowable expenses<\/a>, but it&#8217;s usually more cost-effective to keep those expenses low &#8211; particularly in the early days!<\/li>\n<\/ul>\n<h3>Write a business plan (and regularly revisit it!)<\/h3>\n<p>It’s important to be specific and clear about what your business is so that investors and stakeholders can better understand your goals and objectives. The easiest way to communicate what defines your business and how you intend to reach your goals <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-write-the-perfect-business-plan-25798.html\" rel=\"noopener\" target=\"_blank\">is with a business plan<\/a>.<\/p>\n<p>A plan also helps keep a business on track. You’ll make better decisions if you know what you’re working towards, though you can always make changes as you progress and discover what works for your venture.<\/p>\n<p>Your business plan should include details about what your business does, what products or services it offers, your pricing structure and who else is involved, such as partners and employees. It should also explain how customers will access what you’re selling (so online, by phone or by coming to a premises), as well as your longer-term plans for growth.<\/p>\n<h4>Make a cash flow forecast<\/h4>\n<p>You should consider <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cash-flow-in-business-60140.html\" rel=\"noopener\" target=\"_blank\">creating a cash flow forecast<\/a> even before you launch the business &#8211; it&#8217;s an important part of the planning process. Cash flow forecasting is essentially an estimation of how much money you expect your business to make &#8211; and pay out &#8211; over a specific time period. <\/p>\n<p>Once you have actual bookkeeping figures to refer to, you can use these to make your forecasts more accurate. Keeping your cash flow report up to date will really support your decision-making and give you a sense of financial control!<\/p>\n<h4>Have a marketing plan<\/h4>\n<p>Marketing your business well is essential to success, no matter how uncomfortable you may feel getting out there and selling. Again, like anything in business <a href=\"https:\/\/www.theaccountancy.co.uk\/marketing\/creating-a-marketing-plan-for-your-small-business-55696.html\" rel=\"noopener\" target=\"_blank\">it helps if you have a plan<\/a>. This means planning your strategy for social media, content marketing, PR, marketing events and SEO. It sounds complicated, but even if you want to start your business slowly and rely on word-of-mouth recommendations to grow – that’s a plan!<\/p>\n<p>Our <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/digital-marketing-for-beginners\" rel=\"noopener\" target=\"_blank\">guide to marketing for new businesses<\/a> goes into more detail, but consider:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Your customers<\/li>\n<li>How your business looks, sounds, and seems (known as branding), and whether this is the right message for your business<\/li>\n<li>The best way to let people know your business is on its way<\/li>\n<\/ul>\n<h3>Understand your duties and obligations<\/h3>\n<p>Running your own business means you&#8217;re responsible for pretty much everything, so take your time and make sure you understand what needs to happen and when &#8211; and ask for help when you need it! <\/p>\n<h4>When do you need to submit a tax return?<\/h4>\n<p>Some of your responsibilities will depend on what sort of business structure you choose, such as <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/what-type-of-tax-return-do-i-need-to-submit-2566.html\" rel=\"noopener\" target=\"_blank\">the type of tax returns you need to submit<\/a> (which, in turn, impacts your deadlines for reporting and submitting information).<\/p>\n<div class=\"blogbox\">Visit our <a href=\"https:\/\/www.theaccountancy.co.uk\/key-accounting-and-tax-year-dates\" rel=\"noopener\" target=\"_blank\">Key Tax Year Dates<\/a> calendar to learn more.<\/div>\n<h4>Open a business bank account<\/h4>\n<p>Having <a href=\"https:\/\/www.theaccountancy.co.uk\/bank-accounts\/do-i-need-a-business-bank-account-7561.html\" rel=\"noopener\" target=\"_blank\">a separate bank account for the business<\/a> is a legal requirement for limited companies anyway, but it’s strongly advisable for any business. It’s also particularly useful if you&#8217;re working with someone else, so everyone can see exactly what’s happening and access the account without things getting messy.<\/p>\n<h4>Learn about managing and recording your finances<\/h4>\n<p>Ok, we’re accountants, so we’re going to preach the benefits of <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">creating and maintaining meticulous bookkeeping records<\/a>. It’s because we’re accountants that we know just how beneficial this is – we see it every single day. Keeping your records accurate and up to date:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Is essential for staying out of trouble with HMRC<\/li>\n<li>Makes it much easier to prepare your tax return and accounts<\/li>\n<li>Helps you make more reliable business decisions, based on actual facts<\/li>\n<li>Means you’re more likely to claw back every single allowable expense<\/li>\n<\/ul>\n<p>&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/RyZGvs8Cg10?si=MGTazifmQvBC-G2A\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h3>Take a breath!<\/h3>\n<p>Launching your own business can be <em>insanely<\/em> stressful, whether you&#8217;re <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/do-i-need-to-pay-tax-on-my-hobby-side-business-13671.html\" rel=\"noopener\" target=\"_blank\">sneaking in a side-hustle<\/a>, or launching yourself straight into full-time self-employment. Be kind to yourself! There will be lots of things that you don&#8217;t know, so be prepared to make mistakes. <\/p>\n<p>Getting support from the right places will help, and you&#8217;ll often find mentoring available from networking groups, your local Chamber of Commerce, and even from the bank if you have a business loan. You don&#8217;t have to do absolutely everything yourself, so ask for help when you need it, and take breaks too &#8211; burnout is real!<\/p>\n<p>&nbsp;<br \/>\n<em>Thinking of starting a business? Take a look at <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\" rel=\"noopener\" target=\"_blank\">our guides and videos<\/a> to learn more, or chat to a member of the team to see how we can help. Call 020 3355 4047, or <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Starting your own business is a super exciting time but it can also be a little scary as you try to make&#8230;<\/p>\n","protected":false},"author":20,"featured_media":74649,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[558],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top Tips on How to Start A Business | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top Tips on How to Start A Business | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Starting your own business is a super exciting time but it can also be a little scary as you try to make...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2023-08-18T09:00:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-13T14:29:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Stephanie Whalley\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Stephanie Whalley\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\"},\"author\":{\"name\":\"Stephanie Whalley\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843\"},\"headline\":\"Top Tips on How to Start A Business\",\"datePublished\":\"2023-08-18T09:00:12+00:00\",\"dateModified\":\"2024-06-13T14:29:04+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\"},\"wordCount\":290,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png\",\"articleSection\":[\"Business Start Ups\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\",\"name\":\"Top Tips on How to Start A Business | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png\",\"datePublished\":\"2023-08-18T09:00:12+00:00\",\"dateModified\":\"2024-06-13T14:29:04+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png\",\"width\":1600,\"height\":740,\"caption\":\"Top Tips for Starting A Business at the Start of 2021\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843\",\"name\":\"Stephanie Whalley\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g\",\"caption\":\"Stephanie Whalley\"},\"description\":\"Serial snacker, compulsive cocktail sipper and full time wordsmith with a penchant for alliteration, all things marketing and pineapple on pizza.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/stephanie-whalley\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top Tips on How to Start A Business | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html","og_locale":"en_GB","og_type":"article","og_title":"Top Tips on How to Start A Business | The Accountancy Partnership","og_description":"Starting your own business is a super exciting time but it can also be a little scary as you try to make...","og_url":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2023-08-18T09:00:12+00:00","article_modified_time":"2024-06-13T14:29:04+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png","type":"image\/png"}],"author":"Stephanie Whalley","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Stephanie Whalley","Estimated reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html"},"author":{"name":"Stephanie Whalley","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843"},"headline":"Top Tips on How to Start A Business","datePublished":"2023-08-18T09:00:12+00:00","dateModified":"2024-06-13T14:29:04+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html"},"wordCount":290,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png","articleSection":["Business Start Ups"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html","url":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html","name":"Top Tips on How to Start A Business | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png","datePublished":"2023-08-18T09:00:12+00:00","dateModified":"2024-06-13T14:29:04+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/how-to-start-a-business-from-scratch-74629.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/01\/Top-Tips-for-Starting-A-Business-at-the-Start-of-2021.png","width":1600,"height":740,"caption":"Top Tips for Starting A Business at the Start of 2021"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843","name":"Stephanie Whalley","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g","caption":"Stephanie Whalley"},"description":"Serial snacker, compulsive cocktail sipper and full time wordsmith with a penchant for alliteration, all things marketing and pineapple on pizza.","url":"https:\/\/www.theaccountancy.co.uk\/author\/stephanie-whalley"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/74629"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/20"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=74629"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/74629\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/74649"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=74629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=74629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=74629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}