{"id":88629,"date":"2023-05-21T10:00:41","date_gmt":"2023-05-21T09:00:41","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=88629"},"modified":"2024-06-13T11:55:51","modified_gmt":"2024-06-13T10:55:51","slug":"what-you-need-to-know-about-hiring-an-accountant","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html","title":{"rendered":"Reasons to Hire an Accountant For Your Business"},"content":{"rendered":"<p>Accounting is one of those professions most people are aware of, but might not have much involvement with unless they start a business &#8211; only to find themselves feeling a bit overwhelmed. It’s unsurprising, because running your own business can be extremely hard work.<\/p>\n<p>Lots of business owners do find using an accountant can help ease some of the burden, but to what extent? Whether you’re a brand-new start-up or a grizzled veteran, our step-by-step guide looks at what you need to know before hiring an accountant.<\/p>\n<h3>What do accountants do?<\/h3>\n<p>Most people sign-up for accountancy services because tax is really, really complicated, and they need help making sense of it all without the risk of getting into trouble with HMRC. <\/p>\n<p>In that respect, a good accountant has two principal functions: to make sure your business is tax compliant, whilst helping you be as tax efficient as possible. <\/p>\n<h4>What are the benefits of using an accountant?<\/h4>\n<p>Okay, so they may not have capes or colourful tights, but a good accountant could well turn out to be the hero your business needs.<\/p>\n<p>They’ll stay on top of all the rules and regulations so there’s less risk of penalties and drama, without missing out on any <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/tax-relief\/tax-relief-for-the-self-employed-3833.html\" rel=\"noopener\" target=\"_blank\">allowable tax relief<\/a> you might be able to claim.<\/p>\n<div class=\"actionbox\">In short, you’ll probably pay less tax, but without breaking any rules<\/div>\n<p>&nbsp;<br \/>\nThis often means your accountant will offer guidance on anything from <a href=\"https:\/\/www.theaccountancy.co.uk\/business-start-ups\/which-legal-structure-should-i-choose-when-i-start-a-business-14385.html\" rel=\"noopener\" target=\"_blank\">how to structure your business<\/a> to setting up good bookkeeping processes.<\/p>\n<p>Yep, a decent accountant will charge you a fee, but you might find you save yourself a few quid more than you’re paying… substantially more than a few quid as it happens. They’ll also be able to help you with:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Registering your business<\/li>\n<li>Dealing with HMRC on your behalf <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/authorising-an-agent-to-help-you-with-hmrc-181768.html\" rel=\"noopener\" target=\"_blank\">as your agent<\/a><\/li>\n<li>Completing and submitting tax returns<\/li>\n<li>Preparing your annual accounts (and submitting them to Companies House where necessary)<\/li>\n<li>Making recommendations to become more profitable as well as <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cash-flow-in-business-60140.html\" rel=\"noopener\" target=\"_blank\">improving cash flow management<\/a><\/li>\n<li>Business planning, financial reporting and forecasting, and even <a href=\"https:\/\/www.theaccountancy.co.uk\/fundraising-and-finance\/funding-options-for-small-businesses-36678.html\" rel=\"noopener\" target=\"_blank\">applying for funding<\/a><\/li>\n<\/ul>\n<p>It leaves you to focus on what you’re good at, without the stress of dealing with tax returns and HMRC.<br \/>\n&nbsp;<br \/>\n<center><\/p>\n<div style=\"max-width: 600px;\">\n        <div id='anim_20484' class='animate-me align-center'><\/div>\n        <script class='delay-lottie'>\n            window.addEventListener('DOMContentLoaded', function() {\n                const myImg_20484 = document.querySelector('#anim_20484');\n\n                observer = new IntersectionObserver((entry, observer) => {\n                    if (entry[0].intersectionRatio > 0) {\n                        var animation = bodymovin.loadAnimation({\n                            container: document.getElementById('anim_20484'),\n                            path: 'https:\/\/www.theaccountancy.co.uk\/wp-content\/themes\/tap\/assets\/animations\/accountant-help.json',\n                            renderer: 'svg',\n                            loop: true,\n                            autoplay: true,\n                        });\n                        animation.setSpeed(1);\n                        observer.unobserve(entry[0].target);\n                    }\n                });\n                \n                observer.observe(myImg_20484);\n            });\n        <\/script>\n    <\/div>\n<p><\/center><\/p>\n<h4>Common misconceptions about accounting services<\/h4>\n<p>It’s always a good idea to do plenty of research before making any kind of business investment, and hiring an accountant is no different. But let’s just address some of the stereotypes first (some of our most frequently asked questions, as it happens!), so you have a better understanding of what’s available.<\/p>\n<h4><em>Will hiring an accountant cost too much?<\/em><\/h4>\n<p>Lots of smaller businesses discount the idea of accountancy support because they think it’s going to be unaffordable. That might have been true once, but the growth of online accounting means a greater array of services are more readily available. Firms tend to be much more competitively priced as a result. <\/p>\n<h4><em>Do small businesses need an accountant?<\/em><\/h4>\n<p>It’s certainly not a legal requirement to have one, but accountants aren’t just for larger businesses. The reality is that anyone who needs help making sure their business is tax efficient whilst remaining robustly compliant can benefit from accountancy services.<\/p>\n<p>In fact, if you’re a solopreneur then you probably need help more than anyone. It’s easy to drive yourself mad when you’re trying to manage everything single-handed. An accountant might be able to save you some time and sanity.<\/p>\n<h4><em>Will my accountant manage my business finances for me?<\/em><\/h4>\n<p>Accountants are not financial managers, or miracle workers for that matter! Just because they are involved with your money, cash flow, and profits, doesn’t mean they have any real control over where your money goes.<\/p>\n<p>They’re there to help you understand your options, but it’s your choice what you do with it at the end of the day. It’s also worth pointing out your accountant won’t normally have access to your bank account.<\/p>\n<h4><em>Do I need an accountant if I’m good at maths myself?<\/em><\/h4>\n<p>Decent numeracy skills are a big advantage, but accountants will also record and analyse transactions, and then use their knowledge and experience to advise clients accordingly. It’s more about problem solving, analytical thinking, and knowing the very complicated rules.<br \/>\n&nbsp;<\/p>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/services\/tax-return-service\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Comprehensive tax return services<\/h3>\n<p>From only £24.50 per month<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>How do I choose an accountant to work with?<\/h3>\n<p>Just like every other business decision, this really depends on your circumstances and what it is they can offer you.<\/p>\n<h4>What accounting services do you need?<\/h4>\n<p>Some firms offer very specialist services, but these might not be appropriate for everyone (in which case, you might not need to pay the specialist price tag). For instance, if you’re a contractor who uses subcontractors then <a href=\"https:\/\/www.theaccountancy.co.uk\/cis\/what-is-a-cis-monthly-return-14795.html\" rel=\"noopener\" target=\"_blank\">you may need support with your CIS returns<\/a>. On the other hand, you don&#8217;t really want to be paying for VAT services if you&#8217;re not even VAT registered.<\/p>\n<h5>What services does an accountant offer?<\/h5>\n<p>In general, most accountants will offer a core range of services designed to support small businesses, but a <em>good<\/em> accountant will be available with unlimited support when you have questions!<\/p>\n<p>This could include anything from advice about <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/shares\/what-are-shares-and-who-can-own-them-164105.html\" rel=\"noopener\" target=\"_blank\">structuring shares in a limited company<\/a>, to tax efficiency reviews, to <a href=\"https:\/\/www.theaccountancy.co.uk\/expenses\/leasing-a-car-personally-versus-through-your-limited-company-101194.html\" rel=\"noopener\" target=\"_blank\">leasing a vehicle to use in the business<\/a>. We’ve outlined some of the most common services below, just to get you started.<br \/>\n&nbsp;<\/p>\n<table class=\"tg\">\n<tbody>\n<tr>\n<td class=\"tg-o4o5\" width=\"20%\"><strong>Accounts<\/strong><\/td>\n<td class=\"tg-o4o5\">A set of financial statements which show the performance of your business over a period of time. Some businesses, such as limited companies, need to submit their accounts to Companies House as part of their statutory obligations.<\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>Bookkeeping<\/strong><\/td>\n<td class=\"tg-o4o5\">The <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" rel=\"noopener\" target=\"_blank\">process of recording and managing the financial transactions<\/a> which take place in your business each day. For instance, issuing invoices and following up on unpaid ones, recording supplier invoices, and creating bookkeeping entries to mirror what’s happening in your bank account.<\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>CIS returns<\/strong><\/td>\n<td class=\"tg-o4o5\">A report which contractors must make to tell HMRC about their subcontractors’ pay and deductions.<\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>Company formations<\/strong><\/td>\n<td class=\"tg-o4o5\">Support to <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/incorporation\/how-to-register-as-a-limited-company-in-the-uk-60721.html\" rel=\"noopener\" target=\"_blank\">set up your limited company correctly<\/a> and register with Companies House.<\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>Payroll<\/strong><\/td>\n<td class=\"tg-o4o5\">Correctly calculating how much employees and directors should be paid, making accurate tax deductions, and setting up statutory workplace pension schemes. <\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>Tax returns<\/strong><\/td>\n<td class=\"tg-o4o5\">A report which tells HMRC about the income and expenditure in your business, as well as any other important information – such as the details of any tax relief you’re claiming. The <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/what-type-of-tax-return-do-i-need-to-submit-2566.html\" rel=\"noopener\" target=\"_blank\">type of tax return you need to submit<\/a> depends on your business. <\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>VAT<\/strong><\/td>\n<td class=\"tg-o4o5\">Helping you register for VAT if appropriate (and advising <a href=\"https:\/\/www.theaccountancy.co.uk\/vat\/vat-registration\/should-i-voluntarily-register-for-vat-early-14770.html\" rel=\"noopener\" target=\"_blank\">if it would be tax efficient to do so earlier than required<\/a>) as well as completing and submitting VAT returns.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h4>Check they’re actually qualified<\/h4>\n<p>Anyone can call themselves an accountant, so make sure the firm you’re weighing up has the correct professional qualifications, training, and experience. <\/p>\n<h4>How much accounting help do you need?<\/h4>\n<p>It’s worth considering how much support you think you might need from your accountant. Every firm is different, so some practices might include access to your own dedicated accountant as part of the service, whereas others will charge an additional fee for a one-on-one consultation. <\/p>\n<h4>Do you need to see your accountant face-to-face?<\/h4>\n<p>Even traditional high-street accountancy firms are starting to offer digital services these days, so you might not even need to see your accountant in-person if you don’t want to. Which leads us on to online accounting&#8230;<\/p>\n<h5>What is online accounting?<\/h5>\n<p>Online accountants take this one step further by providing a fully digital service, where you interact with your accountant using the phone, video calls, emails, and live chat. Though a local high street accountant has a physical office for visitors, most of their business these days also happens through emails, calls, and good old post, so you might not notice much difference.<\/p>\n<p>Using an online service also tends to mean you have more choice to shop around and, because they can base themselves in a cheaper location, the fees are likely to be lower.<\/p>\n<div class=\"actionbox\">Just be aware that <em>some<\/em> online accountants outsource work, but online doesn&#8217;t <em>always<\/em> mean outsourced.<\/div>\n<p>&nbsp;<br \/>\nRead the small print carefully if you’re not comfortable with this! A good rule of thumb is to check whether they have a ‘Meet the Team’ page so you can see the people who will be working with you.<br \/>\n&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/_ZP3WHjxLNo?si=fQMQ3E9pf4mPF8-o\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h4>Good questions to ask before hiring an online accountant<\/h4>\n<p>Whether you are hiring one for the first time or are looking at changing your accountant, picking the right one is important. There are plenty to choose from, so it’s important to ask the right questions.<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>What are your various fees and what do they include?<\/li>\n<li>Can you act on my behalf with HMRC?<\/li>\n<li>Will you assign me to one accountant or to a pool of people? <\/li>\n<li>Can I contact my accountant directly when I need to?<\/li>\n<li>What qualifications do your accountants have?<\/li>\n<li>Can you offer me all the services I need?<\/li>\n<li>Which accounting software do you use?<\/li>\n<li>Can you help me stay on top of my reporting deadlines?<\/li>\n<li>How do you deal with complaints?<\/li>\n<li>Is there a limit on how much support or contact I can expect?<\/li>\n<\/ul>\n<h3>Can my new accountant help me switch from my existing one?<\/h3>\n<p>This depends on your new accountant, but lots of firms will <a href=\"https:\/\/www.theaccountancy.co.uk\/changing-accountants\" rel=\"noopener\" target=\"_blank\">take care of the switch over<\/a> if you want them to.<\/p>\n<p>You&#8217;ll normally need to make sure you’ve paid any outstanding fees to your previous accountant, or you might find they (legitimately) refuse to cooperate with your request to change over.<\/p>\n<p>Once you appoint another accountant it’s ethical and routine for them to prepare a letter for you to sign and pass on to your existing accountant. The purpose behind this letter is to:<\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Ask for professional clearance in taking on and managing your accounts going forward<\/li>\n<li>To double check no professional reasons exist as to why your new accountant shouldn’t take you on<\/li>\n<li>Ask for all the relevant paperwork and documents relating to your account to be transferred over<\/li>\n<li>Request your existing accountant provides a letter of disengagement in return. This essentially lays out all the work they’ve completed for you so far, including key pieces of information and important dates you’ll need to sign off on<\/li>\n<\/ul>\n<p>If the accountant you’re currently using is Certified, Chartered or possesses any other professional qualifications, they are duty-bound by their regulatory body to undertake these requests promptly, assuming there are no exceptional circumstances. <\/p>\n<p>Members of professional bodies should also provide the requested documentation without charge. Some accountants may charge a small fee to reflect time spent compiling the paperwork. They’re entitled to do this, though the fee should be proportionate.<\/p>\n<p>If your previous accountant won’t release your accounts for any reason (which can happen if there’s a dispute), then your new provider can normally gather enough information from your records and HMRC to be able to proceed anyway.<\/p>\n<h5>What about if my current accountant is being bought out?<\/h5>\n<p>Just because your usual accountants are being bought out, it doesn’t necessarily mean you have to move on or stick with them. You’re the customer, and it’s your choice! It’s well worth seeing what might be on offer, and how they plan to manage the transition.<\/p>\n<p>It&#8217;s also a good idea to check you&#8217;re existing contract. If your existing firm is being taken over this might mean you&#8217;re released from the terms &#8211; but not always! Your firm should let you know their plans and how this will affect you. If the accounting practice is small, the process of being bought out may be quite quick.<\/p>\n<h3>How do accountants charge clients?<\/h3>\n<p>This varies from one to another; some accountants charge clients an hourly rate, whilst others will put together a package of services charged at a fixed monthly fee to spread the cost across the year. The actual fee can vary a lot, so do your research! <\/p>\n<div class=\"actionbox\">Some crucial advice on accountancy fees: Find out what’s included!<\/div>\n<p>&nbsp;<br \/>\nIt’s well worth remembering accountancy fees are the same as any other purchase; you get what you pay for! Cheapest isn’t always best, especially if you’re looking for a high-quality offering with a diverse range of services.<\/p>\n<h4>Can I claim the cost of accounting as an allowable expense?<\/h4>\n<p>Yep, your accountancy fees are tax deductible, so whatever you pay can be offset against your business income, helping to reduce your tax bill.<\/p>\n<h3>What information do I need to give to an accountant?<\/h3>\n<p>Your new accountant will normally send you some forms to fill in, so they have all the information about you and your business they need. There might be some details that don’t apply to you – such as a VAT registration number if you’re not VAT-registered.<\/p>\n<p>As the relationship evolves, you’ll need to hand over your records on a more regular basis, <a href=\"https:\/\/www.theaccountancy.co.uk\/self-assessment\/information-give-accountant-self-assessment-12863.html\" rel=\"noopener\" target=\"_blank\">particularly when it’s time to complete your tax return<\/a>. Your accountant should definitely tell you what they need! <\/p>\n<p>&nbsp;<br \/>\n<em>Learn more about our online accountancy service for small businesses! Call 020 3355 4047 to chat to the team, and <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Accounting is one of those professions most people are aware of, but might not have much involvement with unless they start a&#8230;<\/p>\n","protected":false},"author":20,"featured_media":88641,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[564,34],"tags":[603],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Reasons to Hire an Accountant For Your Business | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Reasons to Hire an Accountant For Your Business | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Accounting is one of those professions most people are aware of, but might not have much involvement with unless they start a...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2023-05-21T09:00:41+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-13T10:55:51+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Stephanie Whalley\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Stephanie Whalley\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\"},\"author\":{\"name\":\"Stephanie Whalley\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843\"},\"headline\":\"Reasons to Hire an Accountant For Your Business\",\"datePublished\":\"2023-05-21T09:00:41+00:00\",\"dateModified\":\"2024-06-13T10:55:51+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\"},\"wordCount\":2238,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png\",\"keywords\":[\"Startup\"],\"articleSection\":[\"Accountancy FAQs\",\"Online Accounting\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\",\"name\":\"Reasons to Hire an Accountant For Your Business | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png\",\"datePublished\":\"2023-05-21T09:00:41+00:00\",\"dateModified\":\"2024-06-13T10:55:51+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png\",\"width\":1600,\"height\":740,\"caption\":\"Hiring an Accountant\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843\",\"name\":\"Stephanie Whalley\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g\",\"caption\":\"Stephanie Whalley\"},\"description\":\"Serial snacker, compulsive cocktail sipper and full time wordsmith with a penchant for alliteration, all things marketing and pineapple on pizza.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/stephanie-whalley\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Reasons to Hire an Accountant For Your Business | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html","og_locale":"en_GB","og_type":"article","og_title":"Reasons to Hire an Accountant For Your Business | The Accountancy Partnership","og_description":"Accounting is one of those professions most people are aware of, but might not have much involvement with unless they start a...","og_url":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2023-05-21T09:00:41+00:00","article_modified_time":"2024-06-13T10:55:51+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png","type":"image\/png"}],"author":"Stephanie Whalley","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Stephanie Whalley","Estimated reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html"},"author":{"name":"Stephanie Whalley","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843"},"headline":"Reasons to Hire an Accountant For Your Business","datePublished":"2023-05-21T09:00:41+00:00","dateModified":"2024-06-13T10:55:51+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html"},"wordCount":2238,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png","keywords":["Startup"],"articleSection":["Accountancy FAQs","Online Accounting"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html","url":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html","name":"Reasons to Hire an Accountant For Your Business | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png","datePublished":"2023-05-21T09:00:41+00:00","dateModified":"2024-06-13T10:55:51+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2021\/06\/What_happens_if_my_accountant_is_bought_out.png","width":1600,"height":740,"caption":"Hiring an Accountant"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/88f7a6fbdf9c6a2f8dd8308b3f0f6843","name":"Stephanie Whalley","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/edf971117c8d3808cb8c794891c754c7?s=96&d=mm&r=g","caption":"Stephanie Whalley"},"description":"Serial snacker, compulsive cocktail sipper and full time wordsmith with a penchant for alliteration, all things marketing and pineapple on pizza.","url":"https:\/\/www.theaccountancy.co.uk\/author\/stephanie-whalley"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/88629"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/20"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=88629"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/88629\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/88641"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=88629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=88629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=88629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}