{"id":90882,"date":"2024-03-06T10:00:34","date_gmt":"2024-03-06T10:00:34","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?p=90882"},"modified":"2024-06-14T14:47:28","modified_gmt":"2024-06-14T13:47:28","slug":"what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business","status":"publish","type":"post","link":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html","title":{"rendered":"What is Bookkeeping? The complete guide to keeping financial records for your business"},"content":{"rendered":"<p>Bookkeeping is an essential part of managing a business&#8217;s financial health, but it might seem confusing at first. Our guide explains the accounts jargon that might trip you up, and includes advice on how to get your bookkeeping right.<\/p>\n<h3>What is bookkeeping?<\/h3>\n<p>Bookkeeping is the process of recording the daily transactions which take place in a business, in order to show income and spending accurately. Your bookkeeping records should show the money your business has already received or spent, as well as what it expects to happen in the future.<\/p>\n<p>For example, when you receive an invoice from a supplier you haven’t paid yet. You know you’ll have to pay it at some point, so it’s important to include it in your bookkeeping. That way you can plan what you need money for, and when (a process also known as <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cash-flow-in-business-60140.html\" rel=\"noopener\" target=\"_blank\">cash flow management<\/a>). <\/p>\n<p>Click below to watch our video guide which goes through the basics of bookkeeping. We also have <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/bookkeeping-for-small-businesses\" rel=\"noopener\" target=\"_blank\">a guide you can download<\/a> and peruse at your leisure! <\/p>\n<p>&nbsp;<\/p>\n<div class=\"video-wrapper\">\n<div class=\"video-embed\"><iframe loading=\"lazy\" width=\"560\" height=\"315\" src=\"https:\/\/www.youtube.com\/embed\/RyZGvs8Cg10?si=MGTazifmQvBC-G2A\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe><\/div>\n<\/div>\n<h3>So, what is double-entry bookkeeping?<\/h3>\n<p>Double-entry bookkeeping shows that any business transaction represents some sort of exchange. Recording the transaction twice (hence the name ‘double-entry’) allows your bookkeeping to show both sides of this exchange.<\/p>\n<p>For example, a supplier invoice means money has left the business, but this is balanced by something coming back in, such as goods or services.<\/p>\n<h4>How does double-entry bookkeeping help me run my business?<\/h4>\n<p>Recording your business transactions using double-entry bookkeeping is useful because it shows where money is coming from, and where it’s going to.<\/p>\n<div class=\"actionbox\">Being able to see what resources are going where, and when, can help you run your business more efficiently.<\/div>\n<p>&nbsp;<br \/>\nFor instance, making a sale means you no longer have that product or amount of time in your business. Even if you haven’t supplied those goods or services yet, you can’t reuse them because they’re essentially committed elsewhere.<\/p>\n<p>Your invoice reflects something has left the business, but this is balanced by a resource coming back into the business. Usually, this is the money your customer pays you for the sale. Likewise, if you buy materials or pay staff. The money leaving the business is balanced against the resource they provide.<\/p>\n<h4>How do I show transactions in double-entry bookkeeping?<\/h4>\n<p><strong>Sending a customer their invoice is a double entry, and then getting paid for the invoice is another double entry.<\/strong><\/p>\n<p>When you <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/how-do-i-create-an-invoice-226903.html\" rel=\"noopener\" target=\"_blank\">raise an invoice for a customer<\/a>, the amount credits your sales, whilst the debit goes against debtor control as an amount owed to the business. This is one double entry.<\/p>\n<p>Another double entry is needed when the bill is paid. A debit is applied to your banking ledger because the bank balance has increased. A credit is applied to debtor control, to reduce the amount owed by the customer now they have sent the payment.<\/p>\n<p>In this example, the business is invoicing a customer for £10, shown in their bookkeeping with two double entries.<br \/>\n&nbsp;<\/p>\n<table class=\"tg\">\n<tbody>\n<tr>\n<td class=\"tg-o4o5\" style=\"text-align: center;\" width=\"40%\"><\/td>\n<td class=\"tg-o4o5\" style=\"text-align: center;\" width=\"30%\"><strong>Credit<\/strong><\/td>\n<td class=\"tg-o4o5\" style=\"text-align: center;\" width=\"30%\"><strong>Debit<\/strong><\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>The first double entry:<\/strong><br \/>\nWhen you raise the customer invoice<\/td>\n<td class=\"tg-o4o5\">£10 credit against your sales ledger.<\/td>\n<td class=\"tg-o4o5\">£10 debit against debtor control.<\/td>\n<\/tr>\n<tr>\n<td class=\"tg-o4o5\"><strong>The second double entry:<\/strong><br \/>\nWhen the customer pays their invoice<\/td>\n<td class=\"tg-o4o5\">£10 credit against debtor control, reducing the amount owed now the customer has paid.<\/td>\n<td class=\"tg-o4o5\">£10 debit applied to your banking ledger.<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<br \/>\nIt’s easy to get mixed up when referring to credits and debits with the bank. When you put money in your bank account then the bank owes you this money, so they call it a credit. From your own accounting point of view though, an increase in your bank balance is a debit.<\/p>\n<h4>How do I know if my transactions match in double-entry bookkeeping?<\/h4>\n<p>Each of your financial transactions are recorded as a debit and a credit. On one side of the transaction is the debit, and on the other is the credit, so they cancel each other out and balance to zero. Running a trial balance report makes sure these entries match.<\/p>\n<h3>Do I have to keep bookkeeping records for my business?<\/h3>\n<p>If you run a business then HMRC do expect you to maintain good bookkeeping records which show what’s happening in your business. This is true whether you’re a sole trader, a limited company, in a partnership, a freelancer, VAT registered, or any combination of these! <\/p>\n<p>Your bookkeeping records form the basis of every tax return you need to send, so it’s crucial they’re accurate. Good bookkeeping helps you avoid uncomfortable conversations with HMRC auditors, (and any potential fines) but it’s useful for other reasons, too. <\/p>\n<p>Keeping your financial records up-to-date helps you keep track of any money you owe (or are owed which will <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/dealing-with-late-payments-in-a-business-7493.html\" rel=\"noopener\" target=\"_blank\">help with credit control<\/a>) and spot areas where you could save. You&#8217;ll find it much easier to manage your cash flow, too.<\/p>\n<p>Recording all the money you spend on your business means you’ll be able to claim tax relief by clawing back any allowable expenses. Huge numbers of business owners go <a href=\"https:\/\/www.theaccountancy.co.uk\/expenses\/what-do-small-business-owners-really-know-about-expenses-89539.html\" rel=\"noopener\" target=\"_blank\">without claiming tax relief on their business expenses<\/a> every year &#8211; don&#8217;t be one of them! <\/p>\n<div class=\"blogbox\">Check out our guide to <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/claiming-for-business-expenses\" rel=\"noopener\" target=\"_blank\">Claiming Allowable Business Expenses<\/a> for more information.<\/div>\n<h4>What bookkeeping records do I need to keep?<\/h4>\n<p>Your records will generally show every transaction that happens in the business. This means every invoice you send and receive, your banking transactions, expenses and everything that goes with them.<\/p>\n<p>The amount of information you record in your bookkeeping will depend on the size of your business, and how many transactions there are. It can be a lot of information, because your records will need to include the date of the transaction, the amount, what it was for, and who the customers and suppliers are. Your business might also deal with overseas transactions, so you&#8217;ll have the tax implications of this to consider, as well as multiple currencies too!<\/p>\n<p>With all that data flying round you can see why bookkeeping can be such a laborious job, although using bookkeeping software (<a href=\"https:\/\/www.theaccountancy.co.uk\/free-bookkeeping-software\" rel=\"noopener\" target=\"_blank\">like our very own Pandle!<\/a>) can significantly speed this up.<\/p>\n<p>As well as logging the transactions, your bookkeeping records must also include the supporting documents which go with them. So, as well as a list of invoices, you’ll need the actual invoices, for example. <\/p>\n<h4>Bookkeeping for sole traders and limited companies<\/h4>\n<p>It’s also worth considering how your business structure affects the records you keep. As a sole trader there’s no legal difference between you and the business, so your business&#8217; profits are yours to keep, which has implications for tax.<\/p>\n<p>As a director you’re separate from your company, so you’ll need to report the business’s finances, as well as your own income.<br \/>\n&nbsp;<\/p>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/services\/bookkeeping-services\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Bespoke bookkeeping service<\/h3>\n<p>From just £20.00 per month (up to 40 transactions)<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>Are bookkeeping and accounting the same thing?<\/h3>\n<p>The terms bookkeeping and accounting are often used interchangeably, <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/whats-the-difference-between-a-bookkeeper-and-an-accountant-171461.html\" rel=\"noopener\" target=\"_blank\">but the two roles provide different functions<\/a>. <\/p>\n<ul style=\"list-style-image: url('\/wp-content\/uploads\/2020\/12\/check-mark.svg');\">\n<li>Bookkeeping deals with the day-to-day financial activity of a business, recording what happens and managing cash flow.<\/li>\n<li>Accounting uses bookkeeping information to analyse and report on how the business is doing, and helps decision-makers take the right action at the right time.<\/li>\n<\/ul>\n<p>Both are utterly essential for the ongoing success of a business, and make it easier to see what’s working in a business and which areas need more attention.<\/p>\n<h3>Should I outsource my bookkeeping?<\/h3>\n<p>You don’t have to do your own bookkeeping, and can outsource it to someone else, or hire someone to do it in-house for you. It’s up to you who you choose, but going for <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-you-need-to-know-about-hiring-an-accountant-88629.html\" rel=\"noopener\" target=\"_blank\">someone suitably qualified as a bookkeeper or accountant<\/a> will save you a lot of time and effort.<\/p>\n<h3>Can I do my own bookkeeping?<\/h3>\n<p>If you’re a sole trader or run a small company then your bookkeeping is likely to be fairly straightforward. There are no rules that say you have to outsource your bookkeeping, so doing it yourself (or using software which makes it easier) can save you money. <\/p>\n<p>If you’re not sure what you’re doing, or simply don’t have time, then outsourcing it to a bookkeeper or accountant is fine too! As well as weighing up the time versus the cost, be realistic in your ability to maintain accurate, up-to-date bookkeeping records (preferably without getting overwhelmed by stress). <\/p>\n<h4>How often should I do my bookkeeping?<\/h4>\n<p>Everyone sets out with good intentions, but bookkeeping is one of those things that really should be done regularly. Definitely don’t wait until your tax return is due before getting your books in order! <\/p>\n<p>Making sure your bookkeeping is as current as possible helps avoid confusion or errors later on. If you’re not going to outsource your bookkeeping (or get someone in-house), shop around for bookkeeping software which will help you stay up-to-date. <\/p>\n<p>For example, bank feeds will connect your records and bank account, pulling transactions through into your bookkeeping so you don’t need to enter them manually. Some software will even use this process to <a href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/bank-reconciliation-52820.html\" rel=\"noopener\" target=\"_blank\">cut down on time-consuming bank reconciliation checks<\/a>.<br \/>\n&nbsp;<\/p>\n<p><a href=\"https:\/\/www.theaccountancy.co.uk\/free-bookkeeping-software\" target=\"_blank\" rel=\"noopener\"><\/p>\n<div class=\"bannerbox\">\n<div  class=\"bannerwrap\">\n<div class=\"bannerleft\">\n<h3>Free bookkeeping software<\/h3>\n<p>Included in all our accountancy packages<\/p>\n<\/div>\n<div class=\"bannerright\">\n<div class=\"bannercta\">Learn more<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><\/a><\/p>\n<h3>Tips to stay ahead with your bookkeeping<\/h3>\n<p>Your bookkeeping is the basis of the information you need to include in your tax return (Self Assessment, <a href=\"https:\/\/www.theaccountancy.co.uk\/limited-company\/company-tax-return\/company-tax-returns-and-corporation-tax-3746.html\" rel=\"noopener\" target=\"_blank\">Company Tax Return<\/a>, VAT return&#8230;the works.) Rather than risking penalties and stress, our bookkeeping team have some basic techniques to help you keep things on track.  <\/p>\n<h4>Decide how you’ll keep records<\/h4>\n<p>You’ll need some sort of system for recording your expenses and cash flow. You could do this by writing it down in a book, using a spreadsheet, or with software. HMRC are rolling out <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/mtd-making-tax-digital\/preparing-your-business-for-making-tax-digital-13351.html\" rel=\"noopener\" target=\"_blank\">Making Tax Digital (MTD)<\/a> &#8211; a new requirement for keeping digital tax records. <\/p>\n<p>Some businesses are already affected by this, although you might choose to enrol in MTD voluntarily. Using digital bookkeeping will give you a head start! <\/p>\n<div class=\"blogbox\">Visit our <a href=\"https:\/\/www.theaccountancy.co.uk\/making-tax-digital-support-centre\" rel=\"noopener\" target=\"_blank\">MTD information hub<\/a> to learn more.<\/div>\n<h5>Take your bookkeeping to the cloud<\/h5>\n<p>Cloud-based accounting is on the rise, and for good reason. Storing information on the ‘cloud’ means it’s on a server which you can access from anywhere. That way you can keep things up-to-date even if you’re away from your usual workspace.<\/p>\n<h5>Is cloud-based bookkeeping software safe?<\/h5>\n<p>The quick answer is yes. As technological advancements march ever onward, the way businesses deal with their accounts is also changing. Software has become more sophisticated and technology is more mobile, with bookkeeping software evolving to reflect this.<\/p>\n<p>Financial legislation has also played a part in these developments. Open Banking is the UK version of European legislation known as PSD2 (Payment Services Directive). <\/p>\n<p>The legislation means customers can give their bank permission to share their data, and the bank is required to do so through a common ‘language’ authorised platforms can interpret.<\/p>\n<p>These platforms are highly regulated, and once approved they can provide services like <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/what-is-cloud-accounting-13062.html\" rel=\"noopener\" target=\"_blank\">cloud-based bookkeeping software<\/a>. To work with the banks, the software has to meet rigorous security measures to keep your data safe. <\/p>\n<h4>Keep track of important dates<\/h4>\n<p>Set reminders for all of the key dates you’ll need throughout the year. These should include submission and payment deadlines to help you avoid <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/dealing-with-tax-return-penalties-3571.html\" rel=\"noopener\" target=\"_blank\">penalties and interest payments<\/a>, as well as other key dates &#8211; like payroll or loan repayments. There are different submission deadlines depending on your business structure, so take a look at our <a href=\"https:\/\/www.theaccountancy.co.uk\/key-accounting-and-tax-year-dates\" rel=\"noopener\" target=\"_blank\">key tax year dates for businesses<\/a>.<\/p>\n<h4>Separate business and personal finances<\/h4>\n<p>Though you’re not legally required to have <a href=\"https:\/\/www.theaccountancy.co.uk\/bank-accounts\/do-i-need-a-business-bank-account-7561.html\" rel=\"noopener\" target=\"_blank\">a business bank account<\/a> unless you’re a limited company, you might find it easier to have one.<\/p>\n<p>Having your personal and business finances separate will make it easier to watch your cash flow and claim expenses. You won’t have to go through each transaction and remember whether it was for work or not.<\/p>\n<h4>Keep all of your receipts and invoices<\/h4>\n<p>Store all of the documents that go with your bookkeeping records. It makes life easier if there are any questions in the future, and it&#8217;s an HMRC requirement! Make sure you’ve got somewhere to put them, whether it’s a physical place, a folder on your computer, or uploaded them straight into your bookkeeping software. This process will also help you claim back your allowable expenses &#8211; the graphic below shows how much is lost to unclaimed business expenses each year &#8211; it&#8217;s pretty eye-opening!<br \/>\n&nbsp;<\/p>\n<div style=\"text-align: center;\"><img decoding=\"async\" class=\"infographic1 lazyload\" style=\"max-width: 700px;\" title=\"What Do Small Business Owners Really Know about Expenses?\" data-src=\"\/wp-content\/uploads\/2021\/06\/how-much-is-lost-in-unclaimed-expenses-each-year-1.svg\" alt=\"chart showing the amount and range of unclaimed expenses in a year\" src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" \/><\/div>\n<h4>Complete and review your bookkeeping regularly<\/h4>\n<p>If you wait until you have time to deal with your bookkeeping, you’ll probably never actually do it. As a small business owner there are responsibilities coming out of your ears, but bookkeeping is just as important as the rest of them. <\/p>\n<p>Keep your information up to date, and make sure you take time to <a href=\"https:\/\/www.theaccountancy.co.uk\/understanding-accountancy-terms-faqs\/using-financial-reports-in-your-business-63750.html\" rel=\"noopener\" target=\"_blank\">review your financial reports<\/a> (sometimes known as management accounts) regularly. Good bookkeeping software will generate financial reports automatically, helping you take more effective action in the business. <\/p>\n<h4>Take advice from a professional<\/h4>\n<p>If you aren’t a qualified bookkeeper, ask your accountant for some advice. They’ll also be able to help you set up a system which you can actually use and understand, if you’re doing it yourself.<\/p>\n<h4>Save for your tax bill<\/h4>\n<p>Whether you’re a sole trader or a limited company, always make sure you can pay your tax bill on time! Put money aside from every sale, so you can save for your tax bill as you go. Our <a href=\"https:\/\/www.theaccountancy.co.uk\/tax\/uk-tax-rates-thresholds-and-allowances-for-employers-and-the-self-employed-in-2021-22-and-2020-21-2-2-2-51801.html\" rel=\"noopener\" target=\"_blank\">article about UK tax explains this year&#8217;s rates and thresholds<\/a> to help you prepare. And don’t forget about <a href=\"https:\/\/www.theaccountancy.co.uk\/national-insurance\/for-self-employed-businesses-22965.html\" rel=\"noopener\" target=\"_blank\">National Insurance<\/a>! <\/p>\n<p>If you’re a director you’ll need to think about what tax means for both you and for your company. Company directors normally need to <a href=\"https:\/\/www.theaccountancy.co.uk\/self-assessment\/self-assessment-tax-returns-for-company-directors-141570.html\" rel=\"noopener\" target=\"_blank\">submit a Self Assessment tax return<\/a> for their own income, as well as a Company Tax Return to pay any <a href=\"https:\/\/www.theaccountancy.co.uk\/guides-videos\/corporation-tax-for-limited-companies\" rel=\"noopener\" target=\"_blank\">Corporation Tax<\/a> from the business. Good bookkeeping will help you prepare for both! <\/p>\n<p>&nbsp;<br \/>\n<em>Call 020 3355 4047 to talk to one of the team about our <a href=\"https:\/\/www.theaccountancy.co.uk\/services\" rel=\"noopener\" target=\"_blank\">online accounting and bookkeeping services<\/a>, or <a class=\"modal_button\" style=\"cursor: pointer;\">get an instant online quote<\/a>.<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Bookkeeping is an essential part of managing a business&#8217;s financial health, but it might seem confusing at first. Our guide explains the&#8230;<\/p>\n","protected":false},"author":14,"featured_media":53335,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"footnotes":""},"categories":[564,568,576],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Bookkeeping is an essential part of managing a business&#8217;s financial health, but it might seem confusing at first. Our guide explains the...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:published_time\" content=\"2024-03-06T10:00:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-06-14T13:47:28+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1600\" \/>\n\t<meta property=\"og:image:height\" content=\"740\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elizabeth Hughes\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elizabeth Hughes\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\"},\"author\":{\"name\":\"Elizabeth Hughes\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\"},\"headline\":\"What is Bookkeeping? The complete guide to keeping financial records for your business\",\"datePublished\":\"2024-03-06T10:00:34+00:00\",\"dateModified\":\"2024-06-14T13:47:28+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\"},\"wordCount\":2381,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png\",\"articleSection\":[\"Accountancy FAQs\",\"Bookkeeping\",\"Bookkeeping Software\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\",\"name\":\"What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png\",\"datePublished\":\"2024-03-06T10:00:34+00:00\",\"dateModified\":\"2024-06-14T13:47:28+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png\",\"width\":1600,\"height\":740,\"caption\":\"What is Bookkeeping?: The complete guide to keeping financial records for your business\"},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362\",\"name\":\"Elizabeth Hughes\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g\",\"caption\":\"Elizabeth Hughes\"},\"description\":\"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html","og_locale":"en_GB","og_type":"article","og_title":"What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership","og_description":"Bookkeeping is an essential part of managing a business&#8217;s financial health, but it might seem confusing at first. Our guide explains the...","og_url":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_published_time":"2024-03-06T10:00:34+00:00","article_modified_time":"2024-06-14T13:47:28+00:00","og_image":[{"width":1600,"height":740,"url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png","type":"image\/png"}],"author":"Elizabeth Hughes","twitter_card":"summary_large_image","twitter_creator":"@AccountancyPart","twitter_site":"@AccountancyPart","twitter_misc":{"Written by":"Elizabeth Hughes","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#article","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html"},"author":{"name":"Elizabeth Hughes","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362"},"headline":"What is Bookkeeping? The complete guide to keeping financial records for your business","datePublished":"2024-03-06T10:00:34+00:00","dateModified":"2024-06-14T13:47:28+00:00","mainEntityOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html"},"wordCount":2381,"commentCount":0,"publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png","articleSection":["Accountancy FAQs","Bookkeeping","Bookkeeping Software"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html","url":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html","name":"What is Bookkeeping? The complete guide to keeping financial records for your business | The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage"},"thumbnailUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png","datePublished":"2024-03-06T10:00:34+00:00","dateModified":"2024-06-14T13:47:28+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/bookkeeping\/what-is-bookkeeping-the-complete-guide-to-keeping-financial-records-for-your-business-90882.html#primaryimage","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2020\/04\/How-Has-Bookkeeping-Changed-for-Businesses_.png","width":1600,"height":740,"caption":"What is Bookkeeping?: The complete guide to keeping financial records for your business"},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]},{"@type":"Person","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/55cfb33778263ed2de8937b3663d8362","name":"Elizabeth Hughes","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/c2923450743542b9a75b269f8de55b47?s=96&d=mm&r=g","caption":"Elizabeth Hughes"},"description":"A content writer specialising in business, finance, software, and beyond. I'm a wordsmith with a penchant for puns and making complex subjects accessible. Learn more about Elizabeth.","url":"https:\/\/www.theaccountancy.co.uk\/author\/elizabethhughes"}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/90882"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/14"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=90882"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/posts\/90882\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media\/53335"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=90882"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/categories?post=90882"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/tags?post=90882"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}