{"id":15849,"date":"2019-06-24T18:48:58","date_gmt":"2019-06-24T17:48:58","guid":{"rendered":"https:\/\/theaccountancy.wpengine.com\/?page_id=15849"},"modified":"2024-07-03T13:51:18","modified_gmt":"2024-07-03T12:51:18","slug":"full-terms-and-conditions","status":"publish","type":"page","link":"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions","title":{"rendered":"Full Terms and Conditions"},"content":{"rendered":"<div class=\"left-contents\">\n<h4>Below are our full terms and conditions that apply when registering as our client. Every effort has been made to avoid the use of any legalese or jargon!<\/h4>\n<p>&nbsp;<\/p>\n<p><b>1.       <\/b><b>Agreement<\/b><\/p>\n<p>1.0.1. You are appointing The Accountancy Partnership (a trading name of Pandle Ltd, company no. 07083629) as your accountants, to represent you in all matters related to your selected services and your dealings with HMRC. This agreement is made between both parties. This agreement can only be amended or modified by written agreement signed by both parties.<\/p>\n<p>&nbsp;<\/p>\n<p><b>2.       <\/b><b>Confidentiality<\/b><\/p>\n<p>2.0.1. We take the confidentiality of our client’s information very seriously. All accounts, statements and reports prepared by us are for your exclusive use within your business or to meet specific statutory responsibilities. They will not be shown to any third party without your prior consent.<\/p>\n<p>2.0.2. You may appoint someone else to speak to us on your behalf such as your spouse. However, we would require your consent in writing. Please contact us for further details.<\/p>\n<p>2.0.3. For the purposes of the Data Protection Act 1998, the Data Controller in relation to personal data supplied about you is Lee Murphy.<\/p>\n<p>&nbsp;<\/p>\n<p><b>3.       <\/b><b>Agreement of Terms and Cancellation<\/b><\/p>\n<p>3.0.1. This agreement will remain effective from the date we receive your completed registration form. Either party may vary or terminate our authority to act on your behalf at any time without penalty, unless cancellation is before your first month’s payment. In that instance, a £30 fee will become payable to cover our administration costs. Notice of termination must be given in writing or via email. No monthly payments will be refunded to you at any time and cannot be transferred, regardless of whether you have used our services or not, or if your year-end procedure has been performed or not.<\/p>\n<p>3.0.2. These terms and conditions may change from time to time. We always strive to let clients know in advance of a change being made, but it is your responsibility to review the terms regularly for changes made.<\/p>\n<p>3.0.3. If an indemnity claim is made against direct debit payments that were due to be paid, then this amount will be payable to us immediately along with a £30 charge to cover the cost of the indemnity claim to us from our direct debit agency.<\/p>\n<p>&nbsp;<\/p>\n<p><b>4.       <\/b><b>Payments<\/b><\/p>\n<p><strong>Clients who register with us after 20\/12\/2017<\/strong><\/p>\n<p>4.0.1<strong>. <\/strong>Once registered for the service we will issue monthly invoices for your current financial year. Direct debit payments will be collected on a monthly basis for the invoiced amounts. Your first invoice and direct debit will include a backdated amount to the start of your current financial period, for example: if your financial period is 1<sup>st<\/sup> January to 31<sup>st<\/sup> December with a monthly fee of £50 and your first direct debit payment is 1<sup>st<\/sup> June; your first invoice and direct debit amount will be £300 (6 months x £50); and £50 per month thereafter.<\/p>\n<p>If you decide to terminate our service part way through your financial year then no further monthly invoices will be raised from the date of your written cancellation. If you cancel part way through your financial year and would like us to complete that financial year’s work then we would agree to either continue the monthly invoices until the end of the financial year or raise a final invoice up to the financial year end.<\/p>\n<p><strong>Clients who registered with us before 20\/12\/2017<\/strong><\/p>\n<p>4.0.2. Once registered for the service we will issue an invoice for your current financial year. Direct debit payments will be collected on a monthly basis that will reduce the amount of that invoice.<\/p>\n<p>If you decide to terminate our service part way through your financial year then we will raise a credit note for the remaining term of the current financial year and inform you of the balance due if there is one. If you have been switched to monthly invoicing then a credit note will not be required as the monthly invoices will be dated up to the current month only.<\/p>\n<p>If you cancel part way through your financial year and would like us to complete that financial year’s work then we would agree to either continue the monthly invoices until the end of the financial year or raise a final invoice up to the financial year end.<\/p>\n<p><strong>All Clients<\/strong><\/p>\n<p>4.0.3. If you register with us and we find that there is outstanding work due for previous periods then we will contact you straight away for your instruction on whether or not you would like us to give you a quotation for the work involved. A previous period is where a period end is before the current date. For example, if today’s date were 1<sup>st<\/sup> May 2017 and a self-assessment was due for period 6<sup>th<\/sup> April 2016 to 5<sup>th<\/sup> April 2017 then this would be a previous period.<\/p>\n<p>4.0.4. From time to time we will increase fees to keep up with inflation or increasing costs. We will notify you of any fee increases at least 14 days in advance.<\/p>\n<p>4.0.5. Your quotation is based on the information you have provided to us about you and your business. If your business circumstances change then we may adjust our fees to align with these changes. For example, if your business received a quotation based on a turnover bracket and this increases or decreases then the fees will be adjusted to suit. Similarly if you engage us for payroll and add more employees than we have quoted you for then the fee will adjust with these changes. For a breakdown of how our fees are calculated please request a pricing guide from us.<\/p>\n<p><strong>Clients without a Direct Debit facility<\/strong><\/p>\n<p>4.0.6<strong>. <\/strong>Monthly fees are collected by credit\/debit card through Stripe. If or when you change your accountancy package you agree that The Accountancy Partnership may initiate a payment for the agreed fee instantly and recurring monthly thereafter. The fee amount will be determined by the price for the accountancy package at the time of upgrading\/registering which can be seen on The Accountancy Partnership website when selecting the desired additional services from the get an instant quote form or as quoted by a member of the team.<\/p>\n<p>&nbsp;<\/p>\n<p><b>5.       <\/b><b>Late Payments\/defaults<\/b><\/p>\n<p>5.0.1. For outstanding balances overdue by more than 90 days we reserve the right to charge interest at 8% above the base rate per annum until such a time we receive payment in full or receive correspondence from you to resolve the situation.<\/p>\n<p>5.0.2. For sole traders and partnerships the responsibility for any outstanding balances owed to us is of the business owners. For limited companies it is the ultimate responsibility of the director that signed the registration form.<\/p>\n<p>&nbsp;<\/p>\n<p><b>6.       <\/b><b>Authorisation<\/b><\/p>\n<p>6.0.1. Once we have received your registration form we will request that an authorisation code is posted to you from HMRC. Please forward any codes received from HMRC to us as soon as possible to avoid any unnecessary delays with your work.<\/p>\n<p>6.0.2. Once you are registered with us we will perform an identity check to conform with Anti-Money Laundering regulations. This check may involve a credit search, to which you agree to us performing. Please note: the search is a soft search and so does not affect your credit score in any way. We do not carry out this check to assess your credit worthiness.<\/p>\n<p>6.0.3. As with other professional services firms, we are required to identify and verify our clients for the purposes of the UK anti-money laundering legislation. Save in exceptional circumstances we cannot start work until this requirement has been met. We may request from you, and retain, such information and documentation as we require for these purposes and\/or make searches of appropriate databases including ID verification software.<\/p>\n<p>6.0.4. We may share your personal data with our professional body, the Association of Accounting Technicians (AAT), and\/or the Office of Professional Body Anti-Money Laundering Supervisors (OPBAS) in relation to practice assurance and\/or the requirements of the UK anti-money laundering legislation (or any similar legislation) in force.<\/p>\n<p>&nbsp;<\/p>\n<p><b>7.       <\/b><b>Correspondence<\/b><\/p>\n<p>7.0.1. We record all correspondence with clients, including telephone calls. Recordings of all calls are saved within our CRM system and only accessed in the unlikely event we should need to refer to them. You agree to us recording conversations for training and monitoring purposes.<\/p>\n<p>&nbsp;<\/p>\n<p><b>8.       <\/b><b>Referral Fees<\/b><\/p>\n<p>8.0.1. We make use of carefully chosen affiliates that handle extra services offered to our clients. In some instances we may be paid referral fees from those affiliates for the work they receive from us. You agree to allow us to keep any referral fees generated.<\/p>\n<p>&nbsp;<\/p>\n<p><b>9.       <\/b><b>Offers<\/b><\/p>\n<p>9.0.1. Introductory offers apply only if you register as an ongoing client. If you cancel your service within 12 months following the period the offer relates to, then the offer will not apply and the full price will become payable. For example if you are offered free incorporation of your company and were to cancel our services within 12 months then the full price of the free incorporation will become payable.<\/p>\n<p>&nbsp;<\/p>\n<p><b>10.   <\/b><b>Your Responsibility for the Preparation of Financial Statements<\/b><\/p>\n<p>10.0.1. You have undertaken to make available to us, as and when required, all the accounting records and related financial information necessary for the compilation of your accounts. You agree to make full disclosure to us of all relevant information. The accounts will be approved by you before we submit any accounts or returns to HMRC or Companies House.<\/p>\n<p>10.0.2. You are responsible for ensuring that, to the best of your knowledge and belief, financial information, whether used by the business or for the accounts, is reliable. You are also responsible for ensuring that the activities of the business are conducted honestly and that its assets are safeguarded, and for establishing arrangements designed to deter fraudulent or other dishonest conduct and to detect any that occur.<\/p>\n<p>10.0.3. You are responsible for ensuring that the business complies with the laws and regulations applicable to its activities, and for establishing arrangements designed to prevent any non-compliance with laws and regulations and to detect any that occur.<\/p>\n<p>10.0.4. If you used a professional before joining us as a client then it is important that you provide their contact details to us so that we can request vital information from them. If we cannot acquire the information we need to start work for you then we may charge you an additional fee for the time spent to piece together your previous financials.<\/p>\n<p>&nbsp;<\/p>\n<p><b>11.   <\/b><b>Our Responsibilities for the Preparation of Financial Statements<\/b><\/p>\n<p>11.0.1. We will compile your annual accounts based on the accounting records and the information and explanations given to us by you. We shall prepare accounts to be approved by you before any returns are submitted.<\/p>\n<p>11.0.2. We will advise you as to the adequacy of your records for preparation of the annual accounts and make recommendations for improvements which we consider necessary. We shall not be responsible if, as a result of you not taking our advice, you incur losses or penalties.<\/p>\n<p>11.0.3. We will act diligently to produce financial statements which accurately reflect the information supplied by you regarding your business affairs, but will not be responsible for errors arising from incorrect information supplied by you.<\/p>\n<p>11.0.4. Any liability resulting from errors in the preparation of accounts, tax returns or any other work carried out is limited to the fee we charge for completing that work.<\/p>\n<p>11.0.5. We have a professional duty to compile accounts which conform to generally accepted accounting principles.<\/p>\n<p>11.0.6. If you require us to complete additional work which is outside of the services included in your chosen package then we would charge an additional fee appropriate to the work involved, and will be agreed by both parties prior to any work being undertaken.<\/p>\n<p>11.0.7. If we have any records belonging to you after your year-end procedures have been completed then we will return them to you via recorded delivery. If we have retained any records on your instruction then they will be automatically destroyed after 7 years.<\/p>\n<p>11.0.8. The Accountancy Partnership has a legal obligation to adhere to all civil and criminal legislation currently in force.<\/p>\n<p>11.0.9. We will provide our professional services with reasonable care and skill and will always make every effort to ensure you meet the relevant deadlines. However, we will not be responsible for any losses, penalties, surcharges, interest or additional tax liabilities due to HMRC, Companies House or any other organisation under any circumstances. We will however, take individual circumstances into consideration and may make a contribution to penalties at the discretion of the management.<\/p>\n<p>&nbsp;<\/p>\n<p><b>12.   <\/b><b>VAT<\/b><\/p>\n<p>12.0.1. All quoted fees are in pound sterling (£) and exclude VAT at the UK rate.<\/p>\n<p>12.0.2. If your business does not belong in the UK for the purposes of making or receiving supplies of services, then VAT will not be added to our fees. However, it is your responsibility to inform us that this is the case. Your business belongs in the UK if any of the following are true 1. You have a business establishment in the UK and no fixed establishment elsewhere that is more closely connected with the supply 2. You have a business establishment outside of the UK and a fixed establishment in the UK that is mostly directly connected with the supply 3. You do not have a business or fixed establishment anywhere, but your usual place of residence is the UK.<\/p>\n<p>12.0.3. The Accountancy Partnership’s VAT registration number is 106 6800 33<\/p>\n<p>&nbsp;<\/p>\n<p><b>13.   <\/b><b>Professional Indemnity Insurance<\/b><\/p>\n<p>13.0.1. Professional Indemnity Insurance for The Accountancy Partnership is provided by Markel (UK) Limited, Verity House, 6 Canary Wharf, Leeds, LS11 5AT.<\/p>\n<p>&nbsp;<\/p>\n<p><b>14.   <\/b><b>Accounts\/returns<\/b><\/p>\n<p>14.0.1. We will be able to act on your behalf for all of your businesses accounting and taxation affairs from the date that we receive your registration form.<\/p>\n<p>14.0.2. We will prepare the accounts and tax return based on the records and other information and explanations provided by you.<\/p>\n<p>14.0.3. Your approval will be required before we submit any accounts or returns to Companies House or HMRC.<\/p>\n<p>14.0.4. We will advise you as to the amounts of tax to be paid and the dates by which you should make the payments.<\/p>\n<p>14.0.5. If after we complete your accounts\/tax return you should request amendments to be made to the work already completed, then a quotation will be given to you for the additional work involved. We will deal with HMRC regarding any amendments required to your return and prepare any amended returns which may be required.<\/p>\n<p>14.0.6. Any overpayment that arises will be paid into our client account from HMRC and transferred to your bank account the same working day through faster payment.<\/p>\n<p>14.0.7. We will undertake all correspondence with HMRC on your behalf unless instructed otherwise by you.<\/p>\n<p>14.0.8. It is important that you send your records to us in good time before any deadlines. We will send out frequent reminders from the date of your financial year end so that you know that we require your records.<\/p>\n<p>14.0.9. HMRC investigate a proportion of the tax returns submitted each year. Businesses are selected either at random or because submitted figures look incorrect. As long as your service with us remains active we will represent you during an investigation at no additional charge.<\/p>\n<p>14.1.0. You agree that we can approach such third parties as may be appropriate for information that we consider necessary to deal with your affairs.<\/p>\n<p>14.1.1. If you have registered with us as a limited company, up to 2 director’s self-assessments are included within your fee. Self-assessment periods run from 6<sup>th<\/sup> April one year to 5<sup>th<\/sup> April the next. The first one to be included in your fee will be the self-assessment period that your first company&#8217;s financial year end falls in. For example, if your first company’s financial year with us is 1<sup>st<\/sup> July 2017 to 30<sup>th<\/sup> June 2018 the self-assessment(s) included will be for period 6<sup>th<\/sup> April 2018 to 5<sup>th<\/sup> April 2019.<\/p>\n<p>14.1.2. We are general accountants and small business tax specialists and we are able to cater for the vast majority of accounts\/tax requirements a small business may have. Where we do not have the relevant skills\/expertise we will always endeavour to consult with affiliates for assistance. However there are instances where a specialist is required. For example, if your business requires services such as EIS\/SEIS form completion, R&amp;D tax repayments, advice on investments, or TOMS advice we may have to refer you to a specialist who can help. Such specialists may charge a fee for these services.<\/p>\n<p>14.1.3. For limited companies. As UK accountants our service only applies to UK entities, i.e. UK companies or UK tax payers. We cannot offer advice relating to other tax jurisdictions. Where you and\/or your company could be considered tax resident in a country other than the UK it is your responsibility to seek advice from a professional who has expertise in that jurisdiction.<\/p>\n<p>For the most part, if a company is incorporated in the UK, it has corporate residency in the UK. However, there can be exceptions. We only engage with and act on behalf of companies which are resident in the UK, and as such you agree that you have considered your corporate residency and it is that of the UK.<\/p>\n<p>14.1.4. If you sign up to our service as a <strong>limited company<\/strong>, you are entitled to free self-assessments for up to two directors. Included in the free self-assessments can be employment income, employment benefits, UK benefits (including state pension), dividends relating to the UK company that is registered to our service and UK interest which is below £1,000. If there are additional sources of income such as property income or foreign dividends, then there will be additional fees incurred, these will be quoted and agreed in advance of the work taking place. If your limited company is a property company, and you dispose of a property, there will be an additional charge in the accounting period for disposal. This will be quoted and agreed in advance of the work taking place.<\/p>\n<p>14.1.5. If you sign up to our service as a <strong>sole trader<\/strong>, partnership or individual, your self-assessment tax return is included in the fee. Your self-assessment can include employment income, employment benefits, UK benefits (including state pension) and UK interest which is below £1,000. If there are additional sources of income such as property income or foreign dividends, then there will likely be additional fees which will be quoted and agreed in advance of the work taking place.<\/p>\n<p>14.1.6. If your company is eligible to claim Research and Development (R&#038;D) Relief, and you are claiming for the first time or have not claimed in the previous 3 financial periods, then HMRC state that you must notify them within 6 months after your financial period end for which you are claiming for. You acknowledge that it is your responsibility to ensure you meet all deadlines requested by HMRC, we do not offer this service and you would need to appoint a specialist to assist you in this area.<\/p>\n<p>&nbsp;<\/p>\n<p><b>15.   <\/b><b>VAT Returns (if applicable)<\/b><\/p>\n<p>15.0.1. We will be able to act on your behalf for your businesses VAT affairs from the date your registration form is received by us. For any specialist areas of VAT, such as TOMMS, Opt to tax or others, we hold the right to withdraw the VAT services.<\/p>\n<p>15.0.2. We will send the VAT return to you for your approval before it is submitted to HMRC.<\/p>\n<p>15.0.3. We will advise you as to amounts of VAT to be paid (or repaid to you) and the dates by which you should make any payments.<\/p>\n<p>15.0.4. We will undertake all correspondence with HMRC on your behalf unless instructed to do otherwise by you.<\/p>\n<p>15.0.5. Please ensure all supplies made by the business are shown in the records made available to us. It should be understood that our appointment as your agent does not absolve your business from its statutory responsibilities. We would draw your attention to the strict rules and time limits for the submission of such returns and the substantial penalties which may arise if these are not observed. It is therefore essential that we receive full information from you promptly to enable us to ensure that the returns are made on a timely basis.<\/p>\n<p>&nbsp;<\/p>\n<p><b>16.   <\/b><b>Payroll (if applicable)<\/b><\/p>\n<p>16.0.1. To process your payroll we will require certain information from you. This includes:<\/p>\n<p>16.0.2. Notification within two weeks of any employee who is ill for four or more calendar days, including weekends, bank holidays etc. This will enable us to operate statutory sick pay for you.<\/p>\n<p>16.0.3. Notification of any employee who becomes pregnant. This will enable us to operate statutory maternity pay.<\/p>\n<p>16.0.4. Details of any money or benefits made available to employees by you or by a third party through you.<\/p>\n<p>16.0.5. Hours worked, rates of pay, bonuses etc.<\/p>\n<p>16.0.6. Notification of employees engaged by you or leaving your employment.<\/p>\n<p>16.0.7. Details of holiday pay paid to employees.<\/p>\n<p>16.0.8. Any notice of coding received by you (although we should receive a copy)<\/p>\n<p>16.0.9. If any casual labour is taken on, you are required to operate P46 procedures. Completed P46 forms should be supplied to us for processing. Please contact us if you would like us to explain this process.<\/p>\n<p>16.1.0. RTI returns must be received by HMRC on the day that you pay employees so it is very important that we receive your payroll records on time.<\/p>\n<p>16.1.1. It should be understood that our appointment as your agent does not absolve your business from its statutory responsibilities. We would draw your attention to the strict rules and time limits for the submission of such returns and the substantial penalties which may arise if these are not observed. It is therefore essential that we receive full information from you promptly to enable us to ensure that the returns are made on a timely basis.<\/p>\n<p>&nbsp;<\/p>\n<p><b>17.   <\/b><b>Bookkeeping (if applicable)<\/b><\/p>\n<p>17.0.1. If you appoint us to complete bookkeeping on your behalf, we will input your business transactions into a system that best suits your business. We will require all business documentation needed to complete the bookkeeping including sales invoices, purchase invoices, expense receipts, bank statements, paying in\/cheque books and credit card statements (if applicable).<\/p>\n<p>17.0.2. We will keep your paperwork until your year-end procedures have been completed, unless otherwise instructed by you. Once we have finished with your records we will return them to you via recorded delivery.<\/p>\n<p>17.0.3. If you complete your own bookkeeping then we would expect to receive records in a reconciled state (if a double entry system is appropriate). We will take samples to check that the bookkeeping has been completed properly. We will bring to your attention anything that does not seem correct and will await your instructions on how to proceed before continuing with your work. If you would like us to correct any bookkeeping errors we will produce a quotation for you to agree upon before any work is carried out.<\/p>\n<p>17.0.4. If after we complete your bookkeeping, you request amendments to be made to the work already completed, then a quotation will be given to you for the additional work involved.<\/p>\n<p>17.0.5. The bookkeeping quote we provide to you prior to registering with us is based on the volume of transactions you estimate your business produces. Sometimes we find that the actual amount of transactions is more than you initially estimated. In this instance we would raise an invoice for the volume of transactions which exceed your original estimation at our current price per transaction.<\/p>\n<p>17.0.6. If you have special requests for your bookkeeping requirements or where there is a greater than average amount of complexity &#8211; we may quote an hourly rate rather than the standard transactional rate. If we receive bookkeeping records which are more complex than initially estimated we may recalculate the quotation. We will always ask for your agreement of the revised quotation before proceeding with the work.<\/p>\n<p>17.0.7. If we are completing your bookkeeping, the records you send to us (whether electronic or paper based) must be presented in an orderly fashion. Where there is significant time required for us to organise your records we may quote an additional fee for this work.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>18. Registered office address (if applicable):<\/strong><\/p>\n<p>18.0.1. Our registered office address service will only forward correspondence relating to a client’s accountancy obligations from Companies House and HMRC.<\/p>\n<p>18.0.2. If any correspondence is received which is unrelated to our accountancy obligations we will notify clients via email to advise that this address needs to be changed. If we continue to receive this type of correspondence after clients have been notified to update their address, we reserve the right to increase our fee for this service, or remove it completely.<\/p>\n<p>&nbsp;<br \/>\n<strong>19. Contractors and IR35 (if applicable):<\/strong><\/p>\n<p>19.0.1. If some or all of your business relates to contracting then you should consider your risk to IR35. IR35 is legislation that aims to prevent contractors benefiting from tax advantages over that of an employee acting in a similar capacity. It is your responsibility to assess your risk to IR35 although we are happy to provide guidance and material that will help you decide whether you are likely to be inside or outside of the legislation.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>20. <\/strong><b>Fair Usage policy:<\/b><\/p>\n<p>20.0.1. We reserve the right to increase our fees for clients who use our service &#8216;excessively&#8217; to ensure that the business relationship remains profitable. This policy would mainly be enforced for clients who consume the time of our accountants with unnecessary requests, an &#8216;unreasonable&#8217; amount of questions, or queries that are not related to accountancy or the services we offer. We are aware that new clients will require more help and advice when they first register with us or if they are new to business and we do take this into consideration.<\/p>\n<p>20.0.2. If we consider a client to be in breach of this policy we will notify them in writing to give a choice of either an increased fee or a reduction in their demands on the time of our accountants.<\/p>\n<p>20.0.3. The unlimited help and advice included within your chosen package relates to the services you have appointed us to complete. For specialist advice or advice relating to topics outside of your selected services, we would seek to charge a reasonable fee that would be relative to the work involved, and will be agreed upon by both parties prior to any work being undertaken.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>21. Your personal data, privacy and security<\/strong><\/p>\n<p>21.0.1. Please take some time to carefully read through our <a href=\"https:\/\/www.theaccountancy.co.uk\/privacy-policy\" target=\"_blank\" rel=\"noopener noreferrer\">Privacy Policy<\/a>. This policy outlines what data we collect from you, what we do with your data and how we ensure it is secure.<\/p>\n<p>21.0.2. By agreeing to these Terms and Conditions it is assumed that you have read and understood our <a href=\"https:\/\/www.theaccountancy.co.uk\/privacy-policy\" target=\"_blank\" rel=\"noopener noreferrer\">Privacy Policy<\/a>.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>22. Complaints procedure<\/strong><\/p>\n<p>22.0.1. Most of your concerns can be resolved quickly to your satisfaction through the person you are dealing with. If your issue remains unresolved and you would like to make a formal complaint please do so by emailing <a href=\"mailto:clientexperience@theaccountancy.co.uk\">clientexperience@theaccountancy.co.uk<\/a> and our client experience team will look into it. We cannot accept complaints over the phone, they must be in writing.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>23. Respect at work<\/strong><\/p>\n<p>23.0.1 We are committed to creating and maintaining a positive and upbeat working culture for our staff and clients. Our staff will always treat you in a polite and respectful manner. In return you agree to treat our staff in a polite and respectful manner. If it is reasonably deemed that you are rude, aggressive, or abusive to a staff member at any time we reserve the right to immediately terminate all communication with you and resign as your accountant.<\/p>\n<p>&nbsp;<\/p>\n<p><strong>24. Jurisdiction<\/strong><\/p>\n<p>24.0.1 The parties irrevocably agree that the courts of England shall have exclusive jurisdiction to settle any dispute or claim that arises out of or in connection with this Agreement or its subject matter or formation.<\/p>\n<p>&nbsp;<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Below are our full terms and conditions that apply when registering as our client. Every effort has been made to avoid the&#8230;<\/p>\n","protected":false},"author":2,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"footnotes":""},"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v23.0 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Full Terms and Conditions - The Accountancy Partnership<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Full Terms and Conditions - The Accountancy Partnership\" \/>\n<meta property=\"og:description\" content=\"Below are our full terms and conditions that apply when registering as our client. Every effort has been made to avoid the...\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/theaccountancypartnership\" \/>\n<meta property=\"article:modified_time\" content=\"2024-07-03T12:51:18+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@AccountancyPart\" \/>\n<meta name=\"twitter:label1\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"21 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions\",\"name\":\"Full Terms and Conditions - The Accountancy Partnership\",\"isPartOf\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\"},\"datePublished\":\"2019-06-24T17:48:58+00:00\",\"dateModified\":\"2024-07-03T12:51:18+00:00\",\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#website\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"name\":\"The Accountancy Partnership\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#organization\",\"name\":\"The Accountancy Partnership\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"contentUrl\":\"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png\",\"width\":250,\"height\":250,\"caption\":\"The Accountancy Partnership\"},\"image\":{\"@id\":\"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/theaccountancypartnership\",\"https:\/\/x.com\/AccountancyPart\",\"https:\/\/www.linkedin.com\/company\/the-accountancy-partnership\",\"https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Full Terms and Conditions - The Accountancy Partnership","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions","og_locale":"en_GB","og_type":"article","og_title":"Full Terms and Conditions - The Accountancy Partnership","og_description":"Below are our full terms and conditions that apply when registering as our client. Every effort has been made to avoid the...","og_url":"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions","article_publisher":"https:\/\/www.facebook.com\/theaccountancypartnership","article_modified_time":"2024-07-03T12:51:18+00:00","twitter_card":"summary_large_image","twitter_site":"@AccountancyPart","twitter_misc":{"Estimated reading time":"21 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions","url":"https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions","name":"Full Terms and Conditions - The Accountancy Partnership","isPartOf":{"@id":"https:\/\/www.theaccountancy.co.uk\/#website"},"datePublished":"2019-06-24T17:48:58+00:00","dateModified":"2024-07-03T12:51:18+00:00","inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.theaccountancy.co.uk\/full-terms-and-conditions"]}]},{"@type":"WebSite","@id":"https:\/\/www.theaccountancy.co.uk\/#website","url":"https:\/\/www.theaccountancy.co.uk\/","name":"The Accountancy Partnership","description":"","publisher":{"@id":"https:\/\/www.theaccountancy.co.uk\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.theaccountancy.co.uk\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.theaccountancy.co.uk\/#organization","name":"The Accountancy Partnership","url":"https:\/\/www.theaccountancy.co.uk\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/","url":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","contentUrl":"https:\/\/www.theaccountancy.co.uk\/wp-content\/uploads\/2019\/07\/tap-profile-google.png","width":250,"height":250,"caption":"The Accountancy Partnership"},"image":{"@id":"https:\/\/www.theaccountancy.co.uk\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/theaccountancypartnership","https:\/\/x.com\/AccountancyPart","https:\/\/www.linkedin.com\/company\/the-accountancy-partnership","https:\/\/www.youtube.com\/channel\/UCB3RGzS9AiT6hKClaPBDEsw"]}]}},"_links":{"self":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/pages\/15849"}],"collection":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/comments?post=15849"}],"version-history":[{"count":0,"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/pages\/15849\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.theaccountancy.co.uk\/wp-json\/wp\/v2\/media?parent=15849"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}